[
    {
        "page": "about.html",
        "meta-title": "About",
        "meta-description": "My name is Denis Ionut Marginas, I'm 25-year-old, and I've been working as a full-stack web developer and photo-video editor since 2019. Before entering the ...",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact About | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies About Me My name is Denis Ionuț Mărginaș, I'm 27 years old, and I have experience as a full-stack web developer. I am passionate about technology and creativity, always seeking to expand my skills and expertise in web development, staying curious about the latest innovations. Before entering the web development industry, I focused on video editing, specifically for video games. My interest in cinematic executions and angles led to freelance opportunities where I honed my skills. With a strong background in Mathematics and Informatics, I eventually shifted my focus to web development, which has since become my main area of expertise. In my free time, I enjoy building computer hardware, playing video games, cycling, and playing tennis. Looking ahead, I aim to continue growing as a developer, stay updated with the latest technologies, and make a significant impact in the tech industry. When I’m not coding, I enjoy gaming and exploring new technologies that inspire my work. Social Activity Personal Workstation Employee Experience Education Experience Projects Experience List of hobbies Video Games Cycling Table Tennis Photo Editing Video Editing Web Design Computer Hardware Recording Cinematics Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/personal-images\/dm-personal-image-1.webp"
    },
    {
        "page": "contact.html",
        "meta-title": "Contact",
        "meta-description": "You can reach me by phone on WhatsApp or through my personal email address. Contact details are provided in the section below.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Contact | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Contact Data You can reach me by phone on WhatsApp or through my personal email address. Contact details are provided in the section below. Email: denismarginas09@gmail.com Address: Romania, Baia Mare For security reasons, the address is not displayed. However, you can request the contact address by sending an email to the provided email address. Phone: +40-74******* For security reasons, the phone number is not displayed. However, you can request the contact phone number by sending a mail to the provided email address. Resume #3 English CV - Model 3 Sep 27, 2024 Download Resume #3 Romanian CV - Model 3 Sep 27, 2024 Download Resume #2 English CV - Model 2 Jun 3, 2023 Download Resume #2 Romanian CV - Model 2 Jun 3, 2023 Download Resume #1 English CV - Model 1 May 16, 2023 Download Resume #1 Romanian CV - Model 1 May 16, 2023 Download I am a skilled professional with expertise in web development and programming. With a strong foundation in various web platforms and programming languages, I possess the ability to create dynamic and user-friendly websites. My proficiency extends to page builders and web development programs, enabling me to design and customize web pages effectively. I have experience working with a range of software and tools, including photo editing and video editing programs. My knowledge extends to streaming programs and other widely used applications, such as Microsoft Office and Google Suite. With a strong technical aptitude and adaptability, I am confident in my ability to contribute to innovative projects and deliver exceptional results. I am eager to leverage my skills and experiences to make a meaningful impact. Contact Form Submit Next Step Subject Send a Message Hire me for a freelance project Offer me a position at your company Previous Step Next Step Send a Message Previous Step Submit Project Request Web Development Video Editing Photo Editing Other Previous Step Next Job Offer Previous Step Next Go Back Submit Socials ● Google Site: sites.google.com\/view\/denis-marginas ● Google Form: forms.gle\/vTHeLVkc1TwXCxBJA ● Facebook Page: facebook.com\/denismarginas09 ● Linkedin: linkedin.com\/in\/denismarginas09 ● Github: github.com\/denismarginas ● GitHub Pages denismarginas.github.io Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/personal-images\/dm-personal-image-0.webp"
    },
    {
        "page": "education-experience.html",
        "meta-title": "Education Experience",
        "meta-description": "Discover my educational journey from high school to university, including courses and diplomas attained along the way.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Education Experience | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Educational experience path Technical University of Cluj-Napoca UTCNBM Emil Racoviță High School Technical University of Cluj-Napoca UTCNBM 01.10.2016 14.07.2019 University Mathematics-Informatics Studied disciplines: Assembly language programming Computational logic Python programming C programming Computer networking Databases Advanced database management systems Mathematics www.utcluj.ro Student Courses - Bachelor's thesis Emil Racoviță High School 14.09.2012 18.07.2016 High School Mathematics-Informatics Studied disciplines: Mathematics ICT Computer science C++ HTML CSS Visual Fox www.liceulracovita.ro Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/education\/logo-technical-university-of-cluj-napoca-from-baia-mare-utcnbm.webp"
    },
    {
        "page": "employee-experience.html",
        "meta-title": "Employee Experience",
        "meta-description": "Explore my professional journey through my employ experience, where I showcase a chronological record of my employment history. Discover insights into my rol...",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Employee Experience | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Experience as an employee Pia Soft Product Netex Romania Enlivy Mentor Marketing Experts Pia Soft Product 16.10.2019 18.11.2022 Work Function: Full-Stack Web Developer Photo-Video Editor Developed and maintained web applications, troubleshooting, creating documentation, cPanel management, phpmyAdmin, XAMPP, and hosting with Romarg Proficient in utilizing TPL, PHP, SQL, JavaScript, jQuery, CSS, and HTML for application development and usage Create presentation sites and online stores in Wordpress and Prestashop, with a focus on optimizing SEO Create video-photo content for promotional purposes, including banners, logos, video ads, 2D\/3D animation, using tools such as Sony Vegas, Adobe After Effects, Photopea, and Xara Photo Skilled in using the Windows operating system and the Office suite Work Time: 3 Years 1 Month full-time 8h 17.10.2019 - 07.12.2021 part-time 4h 07.12.2021 - 18.11.2022 Remote On-site Hybrid Netex Romania 07.12.2021 05.04.2023 Work Function: Front-End Developer Developed and maintained WordPress sites, troubleshooting, creating documentation Designed various web applications, including Newsletter Mail Translated design from Zeplin into static pages using: Node.js, JavaScript, jQuery, Bootstrap, SASS, CSS and HTML, GitLab Attend conferences in English and present completed tasks on Google Meet Familiar with Linux commands and interface, as well as working with the LibreOffice package Work Time: 1 Year 4 Months full-time 8h 07.12.2021 - 05.04.2023 Remote Enlivy 01.05.2023 31.05.2023 Work Function: Junior Wordpress Developer Developed blocks and pages for a custom WordPress theme using PhpStorm and GitHub Translated designs from a Figma project into functional web pages Utilized Trello for task management and Slack, along with Zoom, for efficient team communication Utilized Prepros 7 to compile the SCSS code for streamlined development Work Time: 1 Month full-time 8h 01.05.2023 - 31.05.2023 Remote Mentor Marketing Experts 26.01.2024 In progress Work Function: Web page designer Developing websites in Wordpress using Elementor and other addons\/plugins for Elementor Translated designs from a Figma project into functional web pages using Elementor Utilized Trello for task management, along with Zoom and Google Meets, for efficient team communication full-time 8h 26.01.2024 - In progress Remote Note: Please be aware that this is not an completed list, and there may be additional professional experiences not mentioned here. If you have specific inquiries about my work history or would like more details, feel free to reach out. 2019 Jan.2019 Feb.2019 Mar.2019 Apr.2019 May.2019 Jun.2019 Jul.2019 Aug.2019 Sep.2019 Oct.2019 Nov.2019 Dec.2019 2020 Jan.2020 Feb.2020 Mar.2020 Apr.2020 May.2020 Jun.2020 Jul.2020 Aug.2020 Sep.2020 Oct.2020 Nov.2020 Dec.2020 2021 Jan.2021 Feb.2021 Mar.2021 Apr.2021 May.2021 Jun.2021 Jul.2021 Aug.2021 Sep.2021 Oct.2021 Nov.2021 Dec.2021 2022 Jan.2022 Feb.2022 Mar.2022 Apr.2022 May.2022 Jun.2022 Jul.2022 Aug.2022 Sep.2022 Oct.2022 Nov.2022 Dec.2022 2023 Jan.2023 Feb.2023 Mar.2023 Apr.2023 May.2023 Jun.2023 Jul.2023 Aug.2023 Sep.2023 Oct.2023 Nov.2023 Dec.2023 2024 Jan.2024 Feb.2024 Mar.2024 Apr.2024 May.2024 Jun.2024 Jul.2024 Aug.2024 Sep.2024 Oct.2024 Nov.2024 Dec.2024 2025 Jan.2025 Feb.2025 Mar.2025 Apr.2025 May.2025 Jun.2025 Jul.2025 Aug.2025 Sep.2025 Oct.2025 Nov.2025 Dec.2025 2019 Jan.2019 Feb.2019 Mar.2019 Apr.2019 May.2019 Jun.2019 Jul.2019 Aug.2019 Sep.2019 Oct.2019 Nov.2019 Dec.2019 2020 Jan.2020 Feb.2020 Mar.2020 Apr.2020 May.2020 Jun.2020 Jul.2020 Aug.2020 Sep.2020 Oct.2020 Nov.2020 Dec.2020 2021 Jan.2021 Feb.2021 Mar.2021 Apr.2021 May.2021 Jun.2021 Jul.2021 Aug.2021 Sep.2021 Oct.2021 Nov.2021 Dec.2021 2022 Jan.2022 Feb.2022 Mar.2022 Apr.2022 May.2022 Jun.2022 Jul.2022 Aug.2022 Sep.2022 Oct.2022 Nov.2022 Dec.2022 2023 Jan.2023 Feb.2023 Mar.2023 Apr.2023 May.2023 Jun.2023 Jul.2023 Aug.2023 Sep.2023 Oct.2023 Nov.2023 Dec.2023 2024 Jan.2024 Feb.2024 Mar.2024 Apr.2024 May.2024 Jun.2024 Jul.2024 Aug.2024 Sep.2024 Oct.2024 Nov.2024 Dec.2024 2025 Jan.2025 Feb.2025 Mar.2025 Apr.2025 May.2025 Jun.2025 Jul.2025 Aug.2025 Sep.2025 Oct.2025 Nov.2025 Dec.2025 Total Work Experience: 5 years, 3 months Total Work Timeline: 4 years, 6 months Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/projects\/piasoftproduct\/logo\/logo.png"
    },
    {
        "page": "experience.html",
        "meta-title": "Experience",
        "meta-description": "Experience a captivating journey through my professional work from 2019 to 2023 in this short video. From a captivating intro to web development, photo editi...",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Experience | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Experience I have experience as a Full-Stack Web Developer on projects such as presentation websites, online shops, booking web applications, competition form applications, and SEO optimization. Additionally, I have experience as a Photo-Video Editor working on projects like ad banners, promotional offers, company logos, identity media content, and video ads. Web Development Technology: PHP, TPL, SQL, JS, Git, HTML, CSS, SASS\/SCSS, Python, C\/C++, jQuery 3, Bootstrap 5 Platforms: WordPress, Prestashop, Node.js, GitHub Pages, Google Site, XAMPP, cPanel CMS: Elementor, WPBakery, Gutenberg Others: HeidiSQL, phpMyAdmin, GitLab, GitHub, Visual Studio Code, PhpStorm, PyCharm, Prepros, Figma Operating Systems: Windows, Linux Photo-Video Editing Video Editing Software: Sony Vegas Pro, Adobe After Effects, Topaz Video Enhance Video Editing Plugins: BCC, RSMB, Sapphire, Ignite Pro, Optical Flares, Plexus, Particular, Element 3D, 3D Camera Tracking Photo Editing Software: Photopea, Photoshop, Paint.net, Xara Photo, Topaz Gigapixel 3D Programs: Blender Office Software Microsoft Office: Microsoft Excel, Microsoft Word, Microsoft PowerPoint Google Drive: Google Sheets, Google Docs, Google Slides Summary Experience Employee Experience Projects Catalog Before entering the web development field, I worked as a freelance video editor, specializing in editing videos for video games. After completing my university studies in Mathematics and Informatics, I shifted my focus to web development and began pursuing a career in that field. In 2019, I joined Pia Soft Product as a web developer and video-photo editor. During my time there, I worked on various tasks, including creating presentation websites and online shops using platforms like WordPress and Prestashop. I also handled SEO optimization, website and host maintenance, customer communication, and designing banners, logos, and video advertisements. Working independently on my tasks, I took the initiative to learn from scratch, except for my prior experience in video editing. Additionally, I developed web applications using PHP, TPL, SQL, JavaScript, jQuery, HTML, CSS, and more. Towards the end of 2021, I transitioned to working full time at Netex Romania, where I was hired as a front-end developer. My responsibilities involved maintaining multiple WordPress websites and working on web design projects. The web design aspect was particularly challenging as I received templates and page sections in formats, similar to Figma projects, and had to recreate them as static web pages using HTML, SASS, Node.js, Bootstrap, JavaScript, and jQuery. Initially, I worked independently on my part of the project, but later collaborated with a colleague who joined to assist with the same project. During this time, I gained valuable experience with the GitLab platform, learned Git commands, and improved my teamwork skills. Projects Web Development Projects Showcase of websites and online shops I have created, featuring engaging designs and seamless functionality. Visual Media Projects Collection of visually captivating projects showcasing my expertise in graphic design, photo editing, and video production. Miscellaneous Projects A mix of non-profit initiatives, personal passion projects, and freelancing work, reflecting my diverse creative endeavors. 0:00 \/ 1x Portfolio Showcase Apr 20, 2023 Experience a captivating journey through my professional work from 2019 to 2023 in this short video. From a captivating intro to web development, photo editing, and video editing, witness my diverse expertise in just under two minutes.Editing Software: Sony Vegas Pro 20, Photopea, Topaz Video Enhance AISondtrack: Skeler - Tel Aviv (Hijacked Remix) Watch on YouTube Video Timeline: 00:00 - 00:04 - Intro 00:04 - 00:55 - Web Development 00:55 - 01:14 - Photo Editing 01:14 - 01:52 - Video Editing 01:52 - 01:56 - Otro Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/personal-images\/dm-personal-with-laptop.webp"
    },
    {
        "page": "home.html",
        "meta-title": "Home",
        "meta-description": "My name is Denis Ionut Marginas, I'm 25-year-old, and I've been working as a full-stack web developer and photo-video editor since 2019. Before entering the ...",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Home | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies About Me My name is Denis Ionuț Mărginaș, I'm 27 years old, and I have experience as a full-stack web developer. I am passionate about technology and creativity, always seeking to expand my skills and expertise in web development, staying curious about the latest innovations. More Details Projects Web Development Projects Showcase of websites and online shops I have created, featuring engaging designs and seamless functionality. Visual Media Projects Collection of visually captivating projects showcasing my expertise in graphic design, photo editing, and video production. Miscellaneous Projects A mix of non-profit initiatives, personal passion projects, and freelancing work, reflecting my diverse creative endeavors. WORK EXPERIENCE Since 2019, I have actively immersed myself in numerous web projects, collaborating with diverse companies to create a wide range of online solutions. Throughout this period, my expertise has encompassed the development of presentation sites, online stores, web applications, SEO optimization, as well as web design. More Details Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/personal-images\/dm-personal-image-2.webp"
    },
    {
        "page": "index.html",
        "meta-title": "Denis Marginas",
        "meta-description": "My name is Denis Ionut Marginas, I'm 25-year-old, and I've been working as a full-stack web developer and photo-video editor since 2019. Before entering the ...",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies About Me My name is Denis Ionuț Mărginaș, I'm 27 years old, and I have experience as a full-stack web developer. I am passionate about technology and creativity, always seeking to expand my skills and expertise in web development, staying curious about the latest innovations. More Details Projects Web Development Projects Showcase of websites and online shops I have created, featuring engaging designs and seamless functionality. Visual Media Projects Collection of visually captivating projects showcasing my expertise in graphic design, photo editing, and video production. Miscellaneous Projects A mix of non-profit initiatives, personal passion projects, and freelancing work, reflecting my diverse creative endeavors. WORK EXPERIENCE Since 2019, I have actively immersed myself in numerous web projects, collaborating with diverse companies to create a wide range of online solutions. Throughout this period, my expertise has encompassed the development of presentation sites, online stores, web applications, SEO optimization, as well as web design. More Details Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/personal-images\/dm-personal-image-2.webp"
    },
    {
        "page": "miscellaneous-projects.html",
        "meta-title": "Miscellaneous Projects",
        "meta-description": "Category: Miscellaneous Projects. A mix of non-profit initiatives, personal passion projects, and freelancing work, reflecting my diverse creative endeavors.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Miscellaneous Projects | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Miscellaneous Projects A blend of non-profit initiatives, personal passion projects, and freelance work, showcasing my varied creative pursuits. Web Development Projects Cekan - Case Study Translated Figma web design for the Case Study section on the cekan.ca website, ensuring 99% accuracy in replicating the responsiv Web Development Projects Promotional campaigns - Tndc In collaboration with TNDC, I developed two website pages, each dedicated to a promotional campaign for Snickers and Orbit (promot Web Development Projects Vreau Alpin I made several significant changes to this site as web design enhancements, content editor, and the addition of new functionalitie Augustin Nail Trainer Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 41 pho Round Selfie Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 5 phot Special Events Discover a captivating collection content that showcase my expertise in delivering impactful visuals content for special eveniment Web Development Projects Prisma Nord The online shop with over 150 products is built on Prestashop 1.7. To add products to the cart, a price and a quantity with a non- Web Development Projects Denis Marginas - Github Portfolio Project name: GitHub Portfolio Website - Denis Marginas. A simple solution to create a free portfolio, offering bulk rendering of Web Development Projects Denis Marginas - Google Site A simple portfolio website created with Google Sites effectively showcases work projects. It features detailed descriptions, image Web Development Projects Striker Production - Google Site Main activity of the Striker Production is the video editing at different video games and real life footage. In addition to creati Web Development Projects Striker Production - Rust KillFeed Generator Simple static website to generate RUST Death Notice overlays for video editing, fast and simple kill-feed generator. The project i Denis Marginas - Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 19 ph Striker Production - Media Main activity of the Striker Production is the video editing at different video games and real life footage. In addition to creati Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/projects\/cekan\/web\/home\/home.webp"
    },
    {
        "page": "privacy-policy.html",
        "meta-title": "Privacy Policy",
        "meta-description": "Learn how we collect, use, and protect your personal data. Our Privacy Policy explains our use of cookies, Google Analytics, and your rights regarding your d...",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Privacy Policy | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Privacy Policy Google Analytics We use Google Analytics on this website to analyze and understand how visitors interact with our site. Google Analytics is a web analytics service provided by Google Inc. It helps us track and report website traffic, allowing us to improve our content and user experience based on data collected. What Google Analytics Does Google Analytics collects data about your visit, including your IP address, browser type, and the pages you view. This information is used to generate reports on website activity and user behavior. The data collected by Google Analytics is aggregated and anonymized, meaning it does not personally identify you. How We Use the Data The information collected through Google Analytics helps us understand how users navigate our site, which pages are popular, and how we can enhance our website's performance. We use this data to make informed decisions about our content and services, aiming to provide a better experience for our visitors. Opt-Out You can choose to opt-out of Google Analytics tracking by installing the Google Analytics Opt-out Browser Add-on or by disabling cookies in your browser settings. Please note that opting out may affect your experience on our website. For more details on how Google Analytics handles your data, you can refer to Google's Privacy Policy. Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": ""
    },
    {
        "page": "projects.html",
        "meta-title": "Projects",
        "meta-description": "Showcase of projects I have created or I was involved, featuring designs and functionality of websites and media content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Projects | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Projects List of projects I have created or I was involved in, featuring designs and functionality of websites and photo-video media content. Web Development Projects Color Play Presentation website created using Elementor, transforming the design from Figma into a functional web design. The website's conte Web Development Projects Liron Pinkhas Presentation website created using Elementor, translating the design from Figma into a functional web design. The website was deve Web Development Projects Bullion House A feature-rich online shop specializing in buying and selling metal coins and bars, designed to handle the complexities of real-ti Web Development Projects Barantech Using Elementor and additional plugins, this presentation website was rebuilt by translating the original design from a custom Wor Web Development Projects SDB - LP A landing page was created to capture interest and drive conversions, utilizing a Figma template for design and Elementor for cont Web Development Projects Marom Steel Line For this project, it was necessary to transform PDF catalogs of products and services into representative pages. This involved cre Web Development Projects Ypages - Pages In this project, I was tasked with translating Figma page designs into WordPress pages. Additionally, I ensured that the design wa Web Development Projects Symbol Buildcon - LP A landing page was created to capture interest and drive conversions, utilizing PSD template for design and Elementor for content Web Development Projects Ryllo - LP A landing page was created to capture interest and drive conversions, utilizing PSD template for design and Elementor for content Web Development Projects GLA Israel Project wich involves designing and developing a website. Utilizing Figma for design the content with Elementor, alongside other p Web Development Projects SOS Deep Cleaning Project wich involves remaking a Wordpress website, was finished in 3-4 days. Utilizing a previous website as a reference for desi Web Development Projects Troni - LP A landing page was created to capture interest and drive conversions, utilizing Figma for design and Elementor for content creatio Web Development Projects MS Car Detailing This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Earldom Tasked with designing and developing a website, including content, functionalities, and futuristic design. Utilizing Figma for des Web Development Projects Family First An online shop where customers can purchase subscriptions to various types of kids' camps (like summer camps and English camps). T Web Development Projects EdlaParis An accommodation booking website for Paris, developed in both Hebrew and English, with calendars fully synchronized with Booking.c Web Development Projects Philadelphia Rug Cleaning This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Logistic Brain This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Merkaz Ha-Ir - City Center This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Miscellaneous Projects Cekan - Case Study Translated Figma web design for the Case Study section on the cekan.ca website, ensuring 99% accuracy in replicating the responsiv Web Development Projects Modern Vision Remodeling This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Miscellaneous Projects Promotional campaigns - Tndc In collaboration with TNDC, I developed two website pages, each dedicated to a promotional campaign for Snickers and Orbit (promot Web Development Projects Petri At this project I worked in a team to create a custom theme in Wordpress. My part at this project was to translate content from th Web Development Projects Miscellaneous Projects Vreau Alpin I made several significant changes to this site as web design enhancements, content editor, and the addition of new functionalitie Visual Media Projects Miscellaneous Projects Augustin Nail Trainer Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 41 pho Visual Media Projects Miscellaneous Projects Round Selfie Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 5 phot Web Development Projects Pur Style At this project I had to make some page reworks, fixing errors adding new features like booking and contact form. The new pages I Web Development Projects Royal Compass At this project I had to make a website for a company that promote sports in nature. This website was not completely finished in t Web Development Projects Super Brain Website made in WordPress for company presentation and contact. The website was made in few days, 3-5 days. At this project I work Visual Media Projects Spalatorie Automata Baia Mare Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 8 phot Visual Media Projects VSE Construct Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 112 ph Web Development Projects Ilnic Electric Ilnic Electric proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the b Web Development Projects Mewi At this Wordpress site, I had to do maintenance, troubleshooting, code changes, plugin updates, and creating HTML & CSS content fo Web Development Projects Visual Media Projects Netex Romania At this site, I had to do maintenance, fixing back-end bugs, PHP files from theme files, troubleshooting, code changes, plugin upd Web Development Projects Reifen Direkt For this project, I had to make HTML static pages. I got previews for a redesign of pages in zeplin format and with them, I make t Web Development Projects AXA Company AXA Company proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the busi Visual Media Projects Gamada Metal Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 3 phot Web Development Projects Medical Ortovit - Products When I started working on it, the website was already 60% complete. Website make in WordPress for blog and the sale of medical pro Web Development Projects Bonea Med This project involved creating a clinic website with appointment booking functionality. I used the Booked module in a WordPress we Web Development Projects Concordia CAR Concordia proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The websi Visual Media Projects Miscellaneous Projects Special Events Discover a captivating collection content that showcase my expertise in delivering impactful visuals content for special eveniment Visual Media Projects Transport Osian Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 1 phot Web Development Projects Acvatic Bebe Club A website has been created using WordPress to provide subscriptions for teaching babies and children how to swim. The site feature Web Development Projects Tinib Website make in WordPress for services like thermal power plants, pumps, air conditioning, ventilation systems. At this website I Web Development Projects Covoare Alex The online shop for different types and models of carpets, is made in Prestashop 1.7 with integrated payment method, via MobilPay. Web Development Projects Brisa Scents I have continued this project from a stage of 20% - 30% done, a WordPress website for perfume and spray sales. User-friendly inter Web Development Projects FreyMob Design The online shop for furniture is made in Prestashop 1.6. The site has 3 languages, and 2 currencies. The products on this applicat Web Development Projects Agromir Second-Hand The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Web Development Projects Resurse Educationale Website for school projects, contests, courses and shop was made in WordPress. It have a custom PHP code integrated with 2 modules Web Development Projects Visual Media Projects Agramix The online shop for tools, machine parts, agricultural and industrial equipment is made in Prestashop 1.7. The theme on which the Web Development Projects Visual Media Projects Casa Darius The online shop for furniture is made in Prestashop 1.7 with integrated payment method, via MobilPay. The products cannot be added Web Development Projects Lavmag The online shop for a wide range of products is built using Prestashop 1.7. All products are regularly updated and uploaded throug Web Development Projects Ambalaje Lavplast The online shop, built on Prestashop 1.7, offers a wide range of products. Customers can conveniently make payments using their ca Web Development Projects Masini in Rate Baia Mare Masini in Rate Baia Mare proudly presents a minimalistic online shop created with WordPress, offering a clean and captivating show Web Development Projects Ceramic & Stone Evolutione Evolutione proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for Web Development Projects Amorino The website, specializing in selling dresses for girls, is built using Prestashop 1.7. Customers have the option to make payments Web Development Projects Centrul de Resurse Educationale Centrul de Resurse Educationale proudly presents a minimalistic website created with WordPress, offering a clean and captivating s Web Development Projects Cafea Gano WordPress website created for an online shop specializing in natural supplements and coffee. The shop was made using the Woocommer Visual Media Projects Dabo - SM & BM Here is my media content for the promotion of Dabo Satu Mare & Dabo Baia Mare during the pandemic, which took place in 2020. Exper Visual Media Projects DS Auto Center Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 4 phot Web Development Projects Visual Media Projects Miscellaneous Projects Prisma Nord The online shop with over 150 products is built on Prestashop 1.7. To add products to the cart, a price and a quantity with a non- Web Development Projects Promotii Mars Website make in WordPress for contests and promotions. Most of the contests are created in a custom PHP form. The design of the fo Web Development Projects Visual Media Projects Agromir The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Visual Media Projects HART - Keep your hat on Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 3 phot Visual Media Projects Bus-Vip Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 151 ph Web Development Projects Casa Darius Casa Darius proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The web Visual Media Projects Speed - Satu Mare Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 4 phot Visual Media Projects My Creative Design Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 2 phot Web Development Projects BRB Home This was one of the first websites I created using WordPress. The purpose of the project was to develop a presentation website aim Web Development Projects Copiatoare Alba Iulia Copiatoare Alba Iulia proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase fo Web Development Projects Visual Media Projects Mobila Simex Plus Mobila Simex Plus proudly presents a minimalistic online shop created with Prestashop 1.7, offering a clean and captivating showca Web Development Projects Visual Media Projects Revel Nail - Avadores The online shop for powders, liquids and other nail accessories is made in Prestashop 1.6. On this website, the products are suppl Web Development Projects Centrul de Excelenta Centrul de Excelenta proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for Web Development Projects Wood Work Art Website make in WordPress for a company that provide authentic solid wood furniture, in modern or vintage style, hand carved or wi Web Development Projects A&A Toys & Furniture This is one of the first websites I have created in my career. When I started working on it, the website was already 25% complete. Web Development Projects Mara Safety This is one of the first websites I have created in my career. When I started working on it, the website was already 30% complete. Web Development Projects Visual Media Projects Pia Soft Product This is a company's presentation site, and is made in Wordpress with modules such as Elementor and Contact Form 7. Also the redesi Web Development Projects Miscellaneous Projects Denis Marginas - Github Portfolio Project name: GitHub Portfolio Website - Denis Marginas. A simple solution to create a free portfolio, offering bulk rendering of Web Development Projects Miscellaneous Projects Denis Marginas - Google Site A simple portfolio website created with Google Sites effectively showcases work projects. It features detailed descriptions, image Web Development Projects Miscellaneous Projects Striker Production - Google Site Main activity of the Striker Production is the video editing at different video games and real life footage. In addition to creati Web Development Projects Miscellaneous Projects Striker Production - Rust KillFeed Generator Simple static website to generate RUST Death Notice overlays for video editing, fast and simple kill-feed generator. The project i Visual Media Projects Miscellaneous Projects Denis Marginas - Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 19 ph Visual Media Projects Miscellaneous Projects Striker Production - Media Main activity of the Striker Production is the video editing at different video games and real life footage. In addition to creati Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/projects\/colorplay\/logo\/logo.png"
    },
    {
        "page": "social-activity.html",
        "meta-title": "Social Activity",
        "meta-description": "Dive into the world of a full-stack web developer and skilled photo-video editor. Explore the intersection of web development and visual storytelling on Deni...",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Social Activity | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Denis Marginas Dive into the world of a full-stack web developer and skilled photo-video editor. Explore the intersection of web development and visual storytelling on Denis Ionut Marginas's insightful blog. Denis Marginas 6 December, 2022 My full name is Mărginaș Denis Ionuț, I am 25 years old, and I've been working as a front-end web developer and photo-video editor since 2019. I started the first time to work after I finished the university, Math-Informatics profile, till then, I had some hobbies like video editing with cinematics in video games, and I make even freelancing with this hobby. In 2019 I started to work at Pia Soft Product as a web developer and video-photo editor. There I made presentation websites and online shops on platforms like WordPress and Prestashop, SEO optimization, website, and host maintenance, talks with customers, banners, logos, and video advertisements. At this job I had to work alone on my part, which meant I had to learn everything alone from 0, besides the video editing part. Also, I develop web applications in PHP, TPL, SQL, JavaScript, jQuery, HTML, CSS, and more. From the end of 2021, the first job became part-time, at 4 hours, and I started to work full time this time at Netex Romania. Here I was hired as a front-end developer, and I had to do maintenance on a few websites in WordPress and web design. The web design part was more complex, I got templates of pages in a different format, similar to photo, and page section parts, with few instructions, and I had to recreate them in static web pages using HTML, SASS, Node.js, Bootstrap, JavaScript and jQuery. The project was big, so I started the first time to work alone on my part of it, but also I had meetings with the back-end developers team, and a few months later, a new colleague came to help me on the same part of the project. There I learned for the first time the GitLab platform, git commands, and most importantly teamwork. See More CV English CV Romanian Denis Marginas 21 December, 2022 Contact Form: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA Contact Form Denis Marginas 21 December, 2022 Denis Marginas: ● Portfolio: https:\/\/sites.google.com\/view\/denis-marginas\/portfolio ● Contact: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA ● Facebook Page: https:\/\/www.facebook.com\/denismarginas09\/ ● Linkedin: www.linkedin.com\/in\/denismarginas09 ● CV English: https:\/\/drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view ● CV Romanian: https:\/\/drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view See More Google Portfolio Contact Denis Marginas 21 December, 2022 Experience: - Web platforms: WordPress, Prestashop, Google Site - Web development languages: PHP, TPL, SQL, JS, HTML, CSS, SASS\/SCSS - Web development programs: cPanel, HeidiSQL, phpMyAdmin, XAMPP, Git, Visual Studio Code, Git, Node.js - Photo editing programs: Photopea, Photoshop, Paint.net, Xara Photo, Topaz Gigapixel. - Libraries: jQuery 3, Bootstrap 5, Font Awesome 4, MaterialDesignWebfront - Video editing programs: Adobe After Effects, Sony Vegas Pro, Topaz Enhance. - 3D programs: Blender - Streaming programs: OBS, Google Meet - Other programs: Microsoft Excel, Microsoft Word, Microsoft PowerPoint, Google Sheet, Google Docs, Google Slides Portfolio: https:\/\/sites.google.com\/view\/denis-marginas\/ See More CV English CV Romanian Denis Marginas 7 March, 2023 PC#0 Setup -------------------------------------------- PC#0 Configuration: - Computer Case Zalman Z1 Neo - Motherboard ASRock B150A-X1 - RAM Corsair Value Select 16GB DDR4 2133MHz CL15 - CPU Intel Skylake Core i5 6500 3.20GHz box - GPU Sapphire Radeon RX 480 NITRO+ 8GB DDR5 256-bit Lite - SSD Patriot P200 512GB 2.5\" SATA III - SSHD Seagate FireCuda 1TB SATA-III 7200RPM 64MB - PSU Sirtec High Power Element BRONZE II 700W PC#0 Accessories: - Monitor LG 23\" LED IPS 23MP48HQ-P - Headset HyperX Cloud Stinger Core Wireless - Mouse Logitech G102 Lightsync - Mechanical Keyboard Logitech G512 Lightsync RGB GX Red Linear See More Denis Marginas 7 March, 2023 PC#1 Setup -------------------------------------------- PC#1 Configuration: - Computer Case AQIRYS Antares ARGB - Motherboard ASUS TUF GAMING B650-PLUS AM5 - RAM Kingston FURY Beast 32GB DDR5 5200MHz CL40 Dual Channel - CPU AMD Ryzen™ 5 7600X 38MB 4.7\/5.3GHz Boost - Cooler ARCTIC Freezer 34 eSports DUO Grey - GPU GIGABYTE GeForce RTX 3070 OC 8GB GDDR6 256-bit - SSD GIGABYTE 480GB SATA-III 2.5 inch - SSD Kingston NV2 1TB PCI Express 4.0 x4 M.2 2280 - PSU GIGABYTE P850GM 80+ Gold 850W PC#1 Accessories: - Headset wireless HyperX Cloud Stinger Core 7.1 - Mouse Pad GENESIS Carbon 700 Maxi Cordura - Mouse LOGITECH G203 LIGHTSYNC RGB, 8.000 dpi - Mechanical Keyboard LOGITECH G512 GX Red Linear - Speakers Trust Arys Compact RGB 2.0 Set - Monitor IPS SAMSUNG Odyssey G5, 27\", WQHD, 165Hz See More Workstation Denis Marginas 20 April, 2023 Portfolio Showcase | Denis Marginas ------------------------------------- This video contains short examples of my professional work from 2019 - 2023. I have knowledge and skills in these sections: - Web platforms: WordPress, Prestashop, Elementor, Google Site - Web development languages: PHP, TPL, SQL, JS, HTML, CSS, SASS\/SCSS - Web development programs: cPanel, HeidiSQL, phpMyAdmin, XAMPP, Git, Visual Studio Code, Git, Node.js - Photo editing programs: Photopea, Photoshop, Paint.net, Xara Photo, Topaz Gigapixel. - Libraries: jQuery 3, Bootstrap 5, Font Awesome 4, MaterialDesignWebfront - Video editing programs: Adobe After Effects, Sony Vegas Pro, Topaz Enhance. - 3D programs: Blender - Streaming programs: OBS, Google Meet - Other programs: Microsoft Excel, Microsoft Word, Microsoft PowerPoint, Google Sheet, Google Docs, Google Slides ------------------------------------- ● Portfolio: https:\/\/sites.google.com\/view\/denis-marginas\/portfolio ● Contact: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA ● Facebook Page: https:\/\/www.facebook.com\/denismarginas09\/ ● LinkedIn: www.linkedin.com\/in\/denismarginas09 ● CV English: https:\/\/drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view ● CV Romanian: https:\/\/drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view ------------------------------------- Song: SKELER - TEL AVIV (HIJACKED REMIX) --------------------------------- Category: Cinematic Edit IRL Project Details: 1900x810p 29.970 FPS Software(s): Sony Vegas Pro 20, Photopea, Topaz Video Enhance AI Scaled up: The video was scaled up from HD to 4k with Topaz Video Enhance AI. Tags: Showcase, Portfolio, Edit --------------------------------- Render PC Summary Specs: CPU: AMD Ryzen™ 5 7600X, 38MB, 4.7\/5.3GHz Boost GPU: GIGABYTE GeForce RTX 3070 GAMING OC LHR 8GB GDDR6 256-bit RAM: Kingston FURY Beast 32GB 5200MHz CL40 Dual Channel Kit See More Video Showcase CV English CV Romanian 0:00 \/ 1x Denis Marginas 1 June, 2023 CV | Resume English | Public Version: https:\/\/lnkd.in\/dbaYXrPC CV English CV Romanian Denis Marginas 18 June, 2023 PC#1 Configuration: - Computer Case AQIRYS Antares ARGB - Motherboard ASUS TUF GAMING B650-PLUS AM5 - RAM Kingston FURY Beast 32GB DDR5 5200MHz CL40 Dual Channel - CPU AMD Ryzen™ 5 7600X 38MB 4.7\/5.3GHz Boost - Cooler ARCTIC Freezer 34 eSports DUO Grey - GPU GIGABYTE GeForce RTX 3070 OC 8GB GDDR6 256-bit - SSD GIGABYTE 480GB SATA-III 2.5 inch - SSD Kingston NV2 1TB PCI Express 4.0 x4 M.2 2280 - PSU GIGABYTE P850GM 80+ Gold 850W PC#1 Accessories: - Headset wireless HyperX Cloud Stinger Core 7.1 - Mouse Pad GENESIS Carbon 700 Maxi Cordura - Mouse LOGITECH G203 LIGHTSYNC RGB, 8.000 dpi - Mechanical Keyboard LOGITECH G512 GX Red Linear - Speakers Trust Arys Compact RGB 2.0 Set - Monitor IPS SAMSUNG Odyssey G5, 27\", WQHD, 165Hz Date: April, 2023 Video Timeline: 00:00 - 00:03 - Intro 00:03 - 00:16 - Setup Info 00:16 - 01:30 - Showcase Peripherals and Accessories 01:30 - 01:52 - Showcase PC Components 02:29 - 02:42 - Otro ------------------------------------- Songs: - LXST CXNTURY - BLOODY TEAR - LXST CXNTURY - MIRAX --------------------------------- Category: Cinematic Edit IRL Project Details: 1900x1080p 29.970 FPS Software(s): Sony Vegas Pro 20, Photopea, Topaz Video Enhance AI Plugin(s): BCC, Sapphire Scaled up: The video was scaled up from HD to 4k with Topaz Video Enhance AI. Tags: IRL Edit, Car Edit --------------------------------- Recording Device: Samsung A52s Main camera: 64 MP, f\/1.8, 26mm (wide), 1\/1.7\", 12 MP f\/2.2, (ultrawide), 5 MP f\/2.4, Recorded in 1080p@30fps --------------------------------- Render PC Summary Specs: CPU: AMD Ryzen™ 5 7600X, 38MB, 4.7\/5.3GHz Boost GPU: GIGABYTE GeForce RTX 3070 GAMING OC LHR 8GB GDDR6 256-bit RAM: Kingston FURY Beast 32GB 5200MHz CL40 Dual Channel Kit See More Workstation Showcase Workstation Details 0:00 \/ 1x Denis Marginas 25 June, 2023 I have knowledge and skills in these categories: ● Web Platforms: WordPress, Prestashop, Google Site ● Page builders: Elementor, WpBakery, Gutenberg ● Operating systems: Windows, Linux ● Languages: PHP, TPL, SQL, JS, HTML, CSS, SASS\/SCSS, Python, C\/C++ ● Libraries: jQuery 3, Bootstrap 5, Font Awesome 4, MaterialDesignWebfront ● Web development programs: cPanel, HeidiSQL, phpMyAdmin, XAMPP, GitLab, GitHub, Visual Studio Code, PhpStorm, PyCharm, Node.js, Prepros, Figma ● Photo editing programs: Photopea, Photoshop, Paint.net, Xara Photo, Topaz Gigapixel ● Video editing programs: Adobe After Effects, Sony Vegas Pro, Topaz Enhance, BCC, RSMB, Sapphire, Ignite Pro, Optical Flares, Plexus, Particular, Element 3d, 3D Camera Tracking ● 3D Programs: Blender ● Streaming programs: OBS, Google Meet, Zoom ● Other programs: Microsoft Excel, Microsoft Word, Microsoft PowerPoint, Google Sheet, Google Docs, Google Slides Contact: ● Email Address: denismarginas09@gmail.com ● Google Form: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA Resume: ● CV English: https:\/\/drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view ● CV Romanian: https:\/\/drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view Socials: ● Facebook Page: https:\/\/www.facebook.com\/denismarginas09\/ ● LinkedIn Account: www.linkedin.com\/in\/denismarginas09 ● GitHub Account: https:\/\/github.com\/denismarginas Portfolio: ● Google Site: https:\/\/sites.google.com\/view\/denis-marginas\/portfolio ● Video Presentation: https:\/\/www.youtube.com\/watch?v=ilz2avyGG_U See More Facebook Linkedin Github Denis Marginas 25 June, 2023 I am excited for the new challenges that a new position in the field of web development will bring. With my extensive experience in working with different web platforms, graphic softwares and programming languages, I' m able to develop websites, web aplications and graphic contents. Contact: ● Email Address: denismarginas09@gmail.com ● Google Form: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA Resume: ● CV English: https:\/\/drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view ● CV Romanian: https:\/\/drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view Socials: ● Facebook Page: https:\/\/www.facebook.com\/denismarginas09\/ ● LinkedIn Account: www.linkedin.com\/in\/denismarginas09 ● GitHub Account: https:\/\/github.com\/denismarginas Portfolio: ● Google Site: https:\/\/sites.google.com\/view\/denis-marginas\/portfolio ● Video Presentation: https:\/\/www.youtube.com\/watch?v=ilz2avyGG_U See More Google Site Video Presentation Denis Marginas 1 December, 2023 CV | Resume English | Public Version: https:\/\/lnkd.in\/dbaYXrPC Links: CV English CV Romanian Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/projects\/denismarginas\/media\/backgrounds\/wallpaper-facebook.webp"
    },
    {
        "page": "summary-experience.html",
        "meta-title": "Summary Work Experience",
        "meta-description": "Experience a captivating journey through my professional work from 2019 to 2023 in this short resume of projects.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Summary Work Experience | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Summary Work Experience 2019 - 2022 Web Development Projects PHP\/SQL\/HTML\/JS\/CSS FORM - WORDPRESS Single Form Page made with PHP, HTML, CSS, JavaScript and SQL. The PHP code works in this way: You get the data from form and at the submit button it will create a database if it doesn't exist, will verify the data, all check boxes must be checked, the input fields must be non empty, one radio box must be checked, the code from invoice with the phone number must be unique and used only once in the database (in this example), the data submit must be within the set data range (begin date - end date) and the file upload must be an image in JPG, PNG or GIF format with maximum size of 40 Mb. If the conditions are met, the image file will be compressed and saved in a folder with the name of SQL table name in 'wp-content', the data will be saved in a SQL table from data base with a URL for image, and in the final, the page will reload and instead of the form content will show a specific banner for success status. 1 \/ 4 2 \/ 4 3 \/ 4 4 \/ 4 If the conditions are not met, a specific error message will be displayed below each field, and if the invoice code was previously used in the database, a pop-up message with a specific error message will be displayed or a banner will be displayed. If the campaign has started, the submit button from the form will not appear or a banner will appear instead of the form, if the campaign is over, a banner will appear instead of the form. A button to download CSV data from data base will show if you are an admin or editor of WordPress, or if you have the credentials from code inserted in URL. The form is implemented with PHP Everywhere widget and Elementor page builder. 1 \/ 3 2 \/ 3 3 \/ 3 Web Development Projects UPLOAD PAID ARTICLES - WORDPRESS This project have a custom PHP code integrated with 2 modules that which allows you uploading files depending on the number of uploads or depending on the subscription. The number of uploads and subscriptions can be purchased with payment by card. The files accepted by the administrator will be displayed on the site and stored in a SQL database. Modules used: Elementor, PHP Everywhere, WooCommerce, WooCommerce Points and Rewards, WooCommerce Memberships Web Development Projects AUTOCOMPLET FORM - PRESTASHOP This is the Contact Form 7 module, but modified (with PHP, TPL and JavaScript), so that it takes over the user's data: name, email, phone and automatically fills them in the form. On the product page is displayed a button to request an offer, and it displays the form form but autocompletes the message field with a text containing the name of the desired product 'I want to receive an offer for this product: product-name'. Modules used: Elementor, Contact Form 7, Boom Custom CSS and Javascript Web Development Projects WEB DESIGN - STATIC WEB PAGES For this project, I hosted a local server with Node.js and I recreated the design from image templates provided, in static web pages using HTML, CSS, SASS, Bootstrap, JavaScript, and jQuery. Web Development Projects SEO OPTIMIZATION - PRESTASHOP & WORDPRESS For some websites, I had to do SEO Optimization, with tools like Google Chrome Lighthouse for fixing errors, adding meta titles, meta descriptions, and keywords for pages, fixing hreflang links, fixing alt images, fixing multiple h1 tags, performance increase where is possible, CSS and JS code inline, adding robots.txt, generate pages map, and indexing on Google Search Console. Projects: www.agromir.ro , www.agramix.ro , www.revelnail.ro . Web Development Projects EXPORT PRODUCTS FEED - PRESTASHOP With this PHP script you can export all products with name, url, images, price, stock, description, summary, ean13. It is not optimized for products with combinations. Can be use as a feed with a cron job. Web Development Projects IMPORT PRODUCTS FROM FEED - PRESTASHOP Add products to the Prestashop 1.7 website from a CSV feed, create products, set stock, create categories, brand, disable if the scripts can't find the products in CSV anymore. This import is made with 2 PHP scripts that are used as cron jobs in cPanel, but can be use with a cron module to. These 2 scripts make stock synchronization possible of 2 stores, in other words it takes the data from feed, feed provided from the globiz.ro store and is used at the lavmag.ro store. Video Editing Projects Video Advertisement - Minimalist Products Showcase Softwares used: Sony Vegas Pro 18, Photopea, Topaz Video Enhance, Topaz Gigapixel AI 0:00 \/ 1x 0:00 \/ 1x Video Editing Projects Video Advertisement - Map Animation Softwares used: Adobe After Effects 2020, Sony Vegas Pro 16, Photopea, Topaz Gigapixel AI Plugin(s): BCC, Sapphire, RSMB, MBL 0:00 \/ 1x Video Editing Projects Video Advertisement - Car Animation Softwares used: BCC, Sapphire, RSMB, MBL Plugin(s): BCC, Sapphire, RSMB, MBL 0:00 \/ 1x Video Editing Projects Video Advertisement - Company Presentation Softwares used: Adobe After Effects 2020, Sony Vegas Pro 16, Photopea Plugin(s): BCC, Sapphire, RSMB, MBL 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x Video Editing Projects Video Advertisement - Video-Games Edits Softwares used: Adobe After Effects 2020, Sony Vegas Pro 16, Photopea Plugin(s): BCC, Sapphire, RSMB, MBL 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x Photo Editing Projects Banner Ads - Company, Products, Sale Softwares used: Photopea, Toppaz Gigapixel Photo Editing Projects Logo Brand - Company\/Personal Softwares used: Photopea, Toppaz Gigapixel 3D EDITING TIRE ANIMATION - BLENDER Simple animation made in Blender with free 3d tire objects for a video advertisement. Softwares used: Blender 0:00 \/ 1x 3D EDITING Personal 3D Blender Renders Photos rendered in blender. Softwares used: Blender Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/summary-experience\/promotions-contact-form-web-1.webp"
    },
    {
        "page": "visual-media-projects.html",
        "meta-title": "Visual Media Projects",
        "meta-description": "Category: Visual Media Projects. Collection of visually captivating projects showcasing my expertise in graphic design, photo editing, and video production.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media Projects | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Visual Media Projects A collection of visually captivating projects that showcase my expertise in graphic design, photo editing, and video production. Each project reflects my ability to create compelling visuals and highlights my diverse skills in the visual arts. Visual Media Projects Spalatorie Automata Baia Mare 2022 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 8 phot Visual Media Projects VSE Construct 2022 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 112 ph Visual Media Projects Netex Romania 2023 At this site, I had to do maintenance, fixing back-end bugs, PHP files from theme files, troubleshooting, code changes, plugin upd Visual Media Projects Gamada Metal 2021 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 3 phot Visual Media Projects Transport Osian 2021 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 1 phot Visual Media Projects Agramix 2021 The online shop for tools, machine parts, agricultural and industrial equipment is made in Prestashop 1.7. The theme on which the Visual Media Projects Casa Darius 2022 The online shop for furniture is made in Prestashop 1.7 with integrated payment method, via MobilPay. The products cannot be added Visual Media Projects Dabo - SM & BM 2020 Here is my media content for the promotion of Dabo Satu Mare & Dabo Baia Mare during the pandemic, which took place in 2020. Exper Visual Media Projects DS Auto Center 2020 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 4 phot Visual Media Projects Agromir 2022 The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Visual Media Projects HART - Keep your hat on 2020 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 3 phot Visual Media Projects Bus-Vip 2022 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 151 ph Visual Media Projects Speed - Satu Mare 2020 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 4 phot Visual Media Projects My Creative Design 2019 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 2 phot Visual Media Projects Mobila Simex Plus 2020 Mobila Simex Plus proudly presents a minimalistic online shop created with Prestashop 1.7, offering a clean and captivating showca Visual Media Projects Revel Nail - Avadores 2022 The online shop for powders, liquids and other nail accessories is made in Prestashop 1.6. On this website, the products are suppl Visual Media Projects Pia Soft Product 2022 This is a company's presentation site, and is made in Wordpress with modules such as Elementor and Contact Form 7. Also the redesi Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/projects\/spalatorieautomatabaiamare\/media\/banners\/banner-1-1-01.webp"
    },
    {
        "page": "web-development-projects.html",
        "meta-title": "Web Development Projects",
        "meta-description": "Category: Web Development Projects. Showcase of websites and online shops I have created, featuring engaging designs and seamless functionality.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Projects | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Web Development Projects A showcase of my work includes websites, online shops, web applications, and web designs that I have created. Each project features engaging designs and seamless functionality, reflecting my commitment to delivering high-quality digital experiences. This collection highlights my diverse skills and creativity in the field of web development. Web Development Projects Color Play 2024 Presentation website created using Elementor, transforming the design from Figma into a functional web design. The website's conte Web Development Projects Liron Pinkhas 2024 Presentation website created using Elementor, translating the design from Figma into a functional web design. The website was deve Web Development Projects Bullion House 2024 A feature-rich online shop specializing in buying and selling metal coins and bars, designed to handle the complexities of real-ti Web Development Projects Barantech 2024 Using Elementor and additional plugins, this presentation website was rebuilt by translating the original design from a custom Wor Web Development Projects SDB - LP 2024 A landing page was created to capture interest and drive conversions, utilizing a Figma template for design and Elementor for cont Web Development Projects Marom Steel Line 2024 For this project, it was necessary to transform PDF catalogs of products and services into representative pages. This involved cre Web Development Projects Ypages - Pages 2024 In this project, I was tasked with translating Figma page designs into WordPress pages. Additionally, I ensured that the design wa Web Development Projects Symbol Buildcon - LP 2024 A landing page was created to capture interest and drive conversions, utilizing PSD template for design and Elementor for content Web Development Projects Ryllo - LP 2024 A landing page was created to capture interest and drive conversions, utilizing PSD template for design and Elementor for content Web Development Projects GLA Israel 2024 Project wich involves designing and developing a website. Utilizing Figma for design the content with Elementor, alongside other p Web Development Projects SOS Deep Cleaning 2024 Project wich involves remaking a Wordpress website, was finished in 3-4 days. Utilizing a previous website as a reference for desi Web Development Projects Troni - LP 2024 A landing page was created to capture interest and drive conversions, utilizing Figma for design and Elementor for content creatio Web Development Projects MS Car Detailing 2024 This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Earldom 2024 Tasked with designing and developing a website, including content, functionalities, and futuristic design. Utilizing Figma for des Web Development Projects Family First 2024 An online shop where customers can purchase subscriptions to various types of kids' camps (like summer camps and English camps). T Web Development Projects EdlaParis 2024 An accommodation booking website for Paris, developed in both Hebrew and English, with calendars fully synchronized with Booking.c Web Development Projects Philadelphia Rug Cleaning 2024 This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Logistic Brain 2024 This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Merkaz Ha-Ir - City Center 2024 This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Modern Vision Remodeling 2024 This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Petri 2023 At this project I worked in a team to create a custom theme in Wordpress. My part at this project was to translate content from th Web Development Projects Pur Style 2023 At this project I had to make some page reworks, fixing errors adding new features like booking and contact form. The new pages I Web Development Projects Royal Compass 2023 At this project I had to make a website for a company that promote sports in nature. This website was not completely finished in t Web Development Projects Super Brain 2022 Website made in WordPress for company presentation and contact. The website was made in few days, 3-5 days. At this project I work Web Development Projects Ilnic Electric 2022 Ilnic Electric proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the b Web Development Projects Mewi 2023 At this Wordpress site, I had to do maintenance, troubleshooting, code changes, plugin updates, and creating HTML & CSS content fo Web Development Projects Netex Romania 2023 At this site, I had to do maintenance, fixing back-end bugs, PHP files from theme files, troubleshooting, code changes, plugin upd Web Development Projects Reifen Direkt 2022 For this project, I had to make HTML static pages. I got previews for a redesign of pages in zeplin format and with them, I make t Web Development Projects AXA Company 2021 AXA Company proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the busi Web Development Projects Medical Ortovit - Products 2021 When I started working on it, the website was already 60% complete. Website make in WordPress for blog and the sale of medical pro Web Development Projects Bonea Med 2022 This project involved creating a clinic website with appointment booking functionality. I used the Booked module in a WordPress we Web Development Projects Concordia CAR 2021 Concordia proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The websi Web Development Projects Acvatic Bebe Club 2021 A website has been created using WordPress to provide subscriptions for teaching babies and children how to swim. The site feature Web Development Projects Tinib 2021 Website make in WordPress for services like thermal power plants, pumps, air conditioning, ventilation systems. At this website I Web Development Projects Covoare Alex 2021 The online shop for different types and models of carpets, is made in Prestashop 1.7 with integrated payment method, via MobilPay. Web Development Projects Brisa Scents 2020 I have continued this project from a stage of 20% - 30% done, a WordPress website for perfume and spray sales. User-friendly inter Web Development Projects FreyMob Design 2021 The online shop for furniture is made in Prestashop 1.6. The site has 3 languages, and 2 currencies. The products on this applicat Web Development Projects Agromir Second-Hand 2022 The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Web Development Projects Resurse Educationale 2020 Website for school projects, contests, courses and shop was made in WordPress. It have a custom PHP code integrated with 2 modules Web Development Projects Agramix 2021 The online shop for tools, machine parts, agricultural and industrial equipment is made in Prestashop 1.7. The theme on which the Web Development Projects Casa Darius 2022 The online shop for furniture is made in Prestashop 1.7 with integrated payment method, via MobilPay. The products cannot be added Web Development Projects Lavmag 2020 The online shop for a wide range of products is built using Prestashop 1.7. All products are regularly updated and uploaded throug Web Development Projects Ambalaje Lavplast 2020 The online shop, built on Prestashop 1.7, offers a wide range of products. Customers can conveniently make payments using their ca Web Development Projects Masini in Rate Baia Mare 2020 Masini in Rate Baia Mare proudly presents a minimalistic online shop created with WordPress, offering a clean and captivating show Web Development Projects Ceramic & Stone Evolutione 2020 Evolutione proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for Web Development Projects Amorino 2020 The website, specializing in selling dresses for girls, is built using Prestashop 1.7. Customers have the option to make payments Web Development Projects Centrul de Resurse Educationale 2022 Centrul de Resurse Educationale proudly presents a minimalistic website created with WordPress, offering a clean and captivating s Web Development Projects Cafea Gano 2020 WordPress website created for an online shop specializing in natural supplements and coffee. The shop was made using the Woocommer Web Development Projects Promotii Mars 2022 Website make in WordPress for contests and promotions. Most of the contests are created in a custom PHP form. The design of the fo Web Development Projects Agromir 2022 The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Web Development Projects Casa Darius 2020 Casa Darius proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The web Web Development Projects BRB Home 2019 This was one of the first websites I created using WordPress. The purpose of the project was to develop a presentation website aim Web Development Projects Copiatoare Alba Iulia 2019 Copiatoare Alba Iulia proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase fo Web Development Projects Mobila Simex Plus 2020 Mobila Simex Plus proudly presents a minimalistic online shop created with Prestashop 1.7, offering a clean and captivating showca Web Development Projects Revel Nail - Avadores 2022 The online shop for powders, liquids and other nail accessories is made in Prestashop 1.6. On this website, the products are suppl Web Development Projects Centrul de Excelenta 2022 Centrul de Excelenta proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for Web Development Projects Wood Work Art 2019 Website make in WordPress for a company that provide authentic solid wood furniture, in modern or vintage style, hand carved or wi Web Development Projects A&A Toys & Furniture 2019 This is one of the first websites I have created in my career. When I started working on it, the website was already 25% complete. Web Development Projects Mara Safety 2019 This is one of the first websites I have created in my career. When I started working on it, the website was already 30% complete. Web Development Projects Pia Soft Product 2022 This is a company's presentation site, and is made in Wordpress with modules such as Elementor and Contact Form 7. Also the redesi Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/projects\/colorplay\/web\/home\/home.webp"
    },
    {
        "page": "workstations.html",
        "meta-title": "Personal Workstations",
        "meta-description": "Here you can check my list with personal workstations setups.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Personal Workstations | Denis Marginas By continuing to use this site, you consent to cookies that enhance your experience and analyze traffic. For more details, please read our Privacy Policy . Accept Cookies Personal Workstations active Personal Workstation Build 1 inactive Personal Workstation Build 0 Contact Data CV English CV Romanian Contact Form Project Types Web Development Projects Visual Media Projects Miscellaneous Projects Socials Beginning of the website: 04.06.2023 Last update of website: 04.01.2025 ©All copyrights reserved by Denis Marginas",
        "default-img": "content\/img\/workstation\/pc-01\/pc_setup_1.webp"
    }
]