[
    {
        "page": "about.html",
        "meta-title": "About",
        "meta-description": "My name is Denis Ionut Marginas, I'm 25-year-old, and I've been working as a full-stack web developer and photo-video editor since 2019. Before entering the web development field, I worked as a freelance video editor, specializing in editing videos for video games.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact About Me My name is Denis Ionuț Mărginaș, I'm 26-year-old, and I've been working as a full-stack web developer and photo-video editor since 2019. Before entering the web development field, I worked as a freelance video editor, specializing in editing videos for video games. After completing my university studies in Mathematics and Informatics, I shifted my focus to web development and began pursuing a career in that field. In 2019, I joined Pia Soft Product as a web developer and video-photo editor. During my time there, I worked on various tasks, including creating presentation websites and online shops using platforms like WordPress and Prestashop. I also handled SEO optimization, website and host maintenance, customer communication, and designing banners, logos, and video advertisements. Working independently on my tasks, I took the initiative to learn from scratch, except for my prior experience in video editing. Additionally, I developed web applications using PHP, TPL, SQL, JavaScript, jQuery, HTML, CSS, and more. Towards the end of 2021, I transitioned to working full time at Netex Romania, where I was hired as a front-end developer. My responsibilities involved maintaining multiple WordPress websites and working on web design projects. The web design aspect was particularly challenging as I received templates and page sections in formats, similar to Figma projects, and had to recreate them as static web pages using HTML, SASS, Node.js, Bootstrap, JavaScript, and jQuery. Initially, I worked independently on my part of the project, but later collaborated with a colleague who joined to assist with the same project. During this time, I gained valuable experience with the GitLab platform, learned Git commands, and improved my teamwork skills. Personal Workstation Employee Experience Summary Experience Projects Experience 0:00 \/ 1x Portfolio Showcase Experience a captivating journey through my professional work from 2019 to 2023 in this short video. From a captivating intro to web development, photo editing, and video editing, witness my diverse expertise in just under two minutes. Watch on YouTube Video Timeline: 00:00 - 00:04 - Intro 00:04 - 00:55 - Web Development 00:55 - 01:14 - Photo Editing 01:14 - 01:52 - Video Editing 01:52 - 01:56 - Otro Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/personal-images\/dm-personal-image-1.webp"
    },
    {
        "page": "blog-activity.html",
        "meta-title": "Blog Activity",
        "meta-description": "Dive into the world of a full-stack web developer and skilled photo-video editor. Explore the intersection of web development and visual storytelling on Denis Ionut Marginas's insightful blog",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Denis Marginas Dive into the world of a full-stack web developer and skilled photo-video editor. Explore the intersection of web development and visual storytelling on Denis Ionut Marginas's insightful blog. Denis Marginas 6 December, 2022 My full name is Mărginaș Denis Ionuț, I am 25 years old, and I've been working as a front-end web developer and photo-video editor since 2019. I started the first time to work after I finished the university, Math-Informatics profile, till then, I had some hobbies like video editing with cinematics in video games, and I make even freelancing with this hobby. In 2019 I started to work at Pia Soft Product as a web developer and video-photo editor. There I made presentation websites and online shops on platforms like WordPress and Prestashop, SEO optimization, website, and host maintenance, talks with customers, banners, logos, and video advertisements. At this job I had to work alone on my part, which meant I had to learn everything alone from 0, besides the video editing part. Also, I develop web applications in PHP, TPL, SQL, JavaScript, jQuery, HTML, CSS, and more. From the end of 2021, the first job became part-time, at 4 hours, and I started to work full time this time at Netex Romania. Here I was hired as a front-end developer, and I had to do maintenance on a few websites in WordPress and web design. The web design part was more complex, I got templates of pages in a different format, similar to photo, and page section parts, with few instructions, and I had to recreate them in static web pages using HTML, SASS, Node.js, Bootstrap, JavaScript and jQuery. The project was big, so I started the first time to work alone on my part of it, but also I had meetings with the back-end developers team, and a few months later, a new colleague came to help me on the same part of the project. There I learned for the first time the GitLab platform, git commands, and most importantly teamwork. See More CV English CV Romanian Denis Marginas 21 December, 2022 Contact Form: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA Contact Form Denis Marginas 21 December, 2022 Denis Marginas: ● Portfolio: https:\/\/sites.google.com\/view\/denis-marginas\/portfolio ● Contact: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA ● Facebook Page: https:\/\/www.facebook.com\/denismarginas09\/ ● Linkedin: www.linkedin.com\/in\/denismarginas09 ● CV English: https:\/\/drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view ● CV Romanian: https:\/\/drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view See More Google Portfolio Contact Denis Marginas 21 December, 2022 Experience: - Web platforms: WordPress, Prestashop, Google Site - Web development languages: PHP, TPL, SQL, JS, HTML, CSS, SASS\/SCSS - Web development programs: cPanel, HeidiSQL, phpMyAdmin, XAMPP, Git, Visual Studio Code, Git, Node.js - Photo editing programs: Photopea, Photoshop, Paint.net, Xara Photo, Topaz Gigapixel. - Libraries: jQuery 3, Bootstrap 5, Font Awesome 4, MaterialDesignWebfront - Video editing programs: Adobe After Effects, Sony Vegas Pro, Topaz Enhance. - 3D programs: Blender - Streaming programs: OBS, Google Meet - Other programs: Microsoft Excel, Microsoft Word, Microsoft PowerPoint, Google Sheet, Google Docs, Google Slides Portfolio: https:\/\/sites.google.com\/view\/denis-marginas\/ See More CV English CV Romanian Denis Marginas 7 March, 2023 PC#0 Setup -------------------------------------------- PC#0 Configuration: - Computer Case Zalman Z1 Neo - Motherboard ASRock B150A-X1 - RAM Corsair Value Select 16GB DDR4 2133MHz CL15 - CPU Intel Skylake Core i5 6500 3.20GHz box - GPU Sapphire Radeon RX 480 NITRO+ 8GB DDR5 256-bit Lite - SSD Patriot P200 512GB 2.5\" SATA III - SSHD Seagate FireCuda 1TB SATA-III 7200RPM 64MB - PSU Sirtec High Power Element BRONZE II 700W PC#0 Accessories: - Monitor LG 23\" LED IPS 23MP48HQ-P - Headset HyperX Cloud Stinger Core Wireless - Mouse Logitech G102 Lightsync - Mechanical Keyboard Logitech G512 Lightsync RGB GX Red Linear See More Denis Marginas 7 March, 2023 PC#1 Setup -------------------------------------------- PC#1 Configuration: - Computer Case AQIRYS Antares ARGB - Motherboard ASUS TUF GAMING B650-PLUS AM5 - RAM Kingston FURY Beast 32GB DDR5 5200MHz CL40 Dual Channel - CPU AMD Ryzen™ 5 7600X 38MB 4.7\/5.3GHz Boost - Cooler ARCTIC Freezer 34 eSports DUO Grey - GPU GIGABYTE GeForce RTX 3070 OC 8GB GDDR6 256-bit - SSD GIGABYTE 480GB SATA-III 2.5 inch - SSD Kingston NV2 1TB PCI Express 4.0 x4 M.2 2280 - PSU GIGABYTE P850GM 80+ Gold 850W PC#1 Accessories: - Headset wireless HyperX Cloud Stinger Core 7.1 - Mouse Pad GENESIS Carbon 700 Maxi Cordura - Mouse LOGITECH G203 LIGHTSYNC RGB, 8.000 dpi - Mechanical Keyboard LOGITECH G512 GX Red Linear - Speakers Trust Arys Compact RGB 2.0 Set - Monitor IPS SAMSUNG Odyssey G5, 27\", WQHD, 165Hz See More Workstation Denis Marginas 20 April, 2023 Portfolio Showcase | Denis Marginas ------------------------------------- This video contains short examples of my professional work from 2019 - 2023. I have knowledge and skills in these sections: - Web platforms: WordPress, Prestashop, Elementor, Google Site - Web development languages: PHP, TPL, SQL, JS, HTML, CSS, SASS\/SCSS - Web development programs: cPanel, HeidiSQL, phpMyAdmin, XAMPP, Git, Visual Studio Code, Git, Node.js - Photo editing programs: Photopea, Photoshop, Paint.net, Xara Photo, Topaz Gigapixel. - Libraries: jQuery 3, Bootstrap 5, Font Awesome 4, MaterialDesignWebfront - Video editing programs: Adobe After Effects, Sony Vegas Pro, Topaz Enhance. - 3D programs: Blender - Streaming programs: OBS, Google Meet - Other programs: Microsoft Excel, Microsoft Word, Microsoft PowerPoint, Google Sheet, Google Docs, Google Slides ------------------------------------- ● Portfolio: https:\/\/sites.google.com\/view\/denis-marginas\/portfolio ● Contact: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA ● Facebook Page: https:\/\/www.facebook.com\/denismarginas09\/ ● LinkedIn: www.linkedin.com\/in\/denismarginas09 ● CV English: https:\/\/drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view ● CV Romanian: https:\/\/drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view ------------------------------------- Song: SKELER - TEL AVIV (HIJACKED REMIX) --------------------------------- Category: Cinematic Edit IRL Project Details: 1900x810p 29.970 FPS Software(s): Sony Vegas Pro 20, Photopea, Topaz Video Enhance AI Scaled up: The video was scaled up from HD to 4k with Topaz Video Enhance AI. Tags: Showcase, Portfolio, Edit --------------------------------- Render PC Summary Specs: CPU: AMD Ryzen™ 5 7600X, 38MB, 4.7\/5.3GHz Boost GPU: GIGABYTE GeForce RTX 3070 GAMING OC LHR 8GB GDDR6 256-bit RAM: Kingston FURY Beast 32GB 5200MHz CL40 Dual Channel Kit See More Video Showcase CV English CV Romanian 0:00 \/ 1x Denis Marginas 1 June, 2023 CV | Resume English | Public Version: https:\/\/lnkd.in\/dbaYXrPC CV English CV Romanian Denis Marginas 18 June, 2023 PC#1 Configuration: - Computer Case AQIRYS Antares ARGB - Motherboard ASUS TUF GAMING B650-PLUS AM5 - RAM Kingston FURY Beast 32GB DDR5 5200MHz CL40 Dual Channel - CPU AMD Ryzen™ 5 7600X 38MB 4.7\/5.3GHz Boost - Cooler ARCTIC Freezer 34 eSports DUO Grey - GPU GIGABYTE GeForce RTX 3070 OC 8GB GDDR6 256-bit - SSD GIGABYTE 480GB SATA-III 2.5 inch - SSD Kingston NV2 1TB PCI Express 4.0 x4 M.2 2280 - PSU GIGABYTE P850GM 80+ Gold 850W PC#1 Accessories: - Headset wireless HyperX Cloud Stinger Core 7.1 - Mouse Pad GENESIS Carbon 700 Maxi Cordura - Mouse LOGITECH G203 LIGHTSYNC RGB, 8.000 dpi - Mechanical Keyboard LOGITECH G512 GX Red Linear - Speakers Trust Arys Compact RGB 2.0 Set - Monitor IPS SAMSUNG Odyssey G5, 27\", WQHD, 165Hz Date: April, 2023 Video Timeline: 00:00 - 00:03 - Intro 00:03 - 00:16 - Setup Info 00:16 - 01:30 - Showcase Peripherals and Accessories 01:30 - 01:52 - Showcase PC Components 02:29 - 02:42 - Otro ------------------------------------- Songs: - LXST CXNTURY - BLOODY TEAR - LXST CXNTURY - MIRAX --------------------------------- Category: Cinematic Edit IRL Project Details: 1900x1080p 29.970 FPS Software(s): Sony Vegas Pro 20, Photopea, Topaz Video Enhance AI Plugin(s): BCC, Sapphire Scaled up: The video was scaled up from HD to 4k with Topaz Video Enhance AI. Tags: IRL Edit, Car Edit --------------------------------- Recording Device: Samsung A52s Main camera: 64 MP, f\/1.8, 26mm (wide), 1\/1.7\", 12 MP f\/2.2, (ultrawide), 5 MP f\/2.4, Recorded in 1080p@30fps --------------------------------- Render PC Summary Specs: CPU: AMD Ryzen™ 5 7600X, 38MB, 4.7\/5.3GHz Boost GPU: GIGABYTE GeForce RTX 3070 GAMING OC LHR 8GB GDDR6 256-bit RAM: Kingston FURY Beast 32GB 5200MHz CL40 Dual Channel Kit See More Workstation Showcase Workstation Details 0:00 \/ 1x Denis Marginas 25 June, 2023 I have knowledge and skills in these categories: ● Web Platforms: WordPress, Prestashop, Google Site ● Page builders: Elementor, WpBakery, Gutenberg ● Operating systems: Windows, Linux ● Languages: PHP, TPL, SQL, JS, HTML, CSS, SASS\/SCSS, Python, C\/C++ ● Libraries: jQuery 3, Bootstrap 5, Font Awesome 4, MaterialDesignWebfront ● Web development programs: cPanel, HeidiSQL, phpMyAdmin, XAMPP, GitLab, GitHub, Visual Studio Code, PhpStorm, PyCharm, Node.js, Prepros, Figma ● Photo editing programs: Photopea, Photoshop, Paint.net, Xara Photo, Topaz Gigapixel ● Video editing programs: Adobe After Effects, Sony Vegas Pro, Topaz Enhance, BCC, RSMB, Sapphire, Ignite Pro, Optical Flares, Plexus, Particular, Element 3d, 3D Camera Tracking ● 3D Programs: Blender ● Streaming programs: OBS, Google Meet, Zoom ● Other programs: Microsoft Excel, Microsoft Word, Microsoft PowerPoint, Google Sheet, Google Docs, Google Slides Contact: ● Email Address: denismarginas09@gmail.com ● Google Form: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA Resume: ● CV English: https:\/\/drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view ● CV Romanian: https:\/\/drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view Socials: ● Facebook Page: https:\/\/www.facebook.com\/denismarginas09\/ ● LinkedIn Account: www.linkedin.com\/in\/denismarginas09 ● GitHub Account: https:\/\/github.com\/denismarginas Portfolio: ● Google Site: https:\/\/sites.google.com\/view\/denis-marginas\/portfolio ● Video Presentation: https:\/\/www.youtube.com\/watch?v=ilz2avyGG_U See More Facebook Linkedin Github Denis Marginas 25 June, 2023 I am excited for the new challenges that a new position in the field of web development will bring. With my extensive experience in working with different web platforms, graphic softwares and programming languages, I' m able to develop websites, web aplications and graphic contents. Contact: ● Email Address: denismarginas09@gmail.com ● Google Form: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA Resume: ● CV English: https:\/\/drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view ● CV Romanian: https:\/\/drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view Socials: ● Facebook Page: https:\/\/www.facebook.com\/denismarginas09\/ ● LinkedIn Account: www.linkedin.com\/in\/denismarginas09 ● GitHub Account: https:\/\/github.com\/denismarginas Portfolio: ● Google Site: https:\/\/sites.google.com\/view\/denis-marginas\/portfolio ● Video Presentation: https:\/\/www.youtube.com\/watch?v=ilz2avyGG_U See More Google Site Video Presentation Denis Marginas 1 December, 2023 CV | Resume English | Public Version: https:\/\/lnkd.in\/dbaYXrPC Links: CV English CV Romanian Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/denismarginas\/media\/backgrounds\/wallpaper-facebook.webp"
    },
    {
        "page": "contact.html",
        "meta-title": "Contact",
        "meta-description": "You can reach me by phone on WhatsApp or through my personal email address. Contact details are provided in the section below.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Contact Data You can reach me by phone on WhatsApp or through my personal email address. Contact details are provided in the section below. Email: denismarginas09@gmail.com Address: Romania, Baia Mare For security reasons, the address is not displayed. However, you can request the contact address by sending an email to the provided email address. Phone +40-74******* For security reasons, the phone number is not displayed. However, you can request the contact phone number by sending a mail to the provided email address. Resume #2 English CV - Model 2 Jun 3, 2023 Download Resume #2 Romanian CV - Model 2 Jun 3, 2023 Download Resume #1 English CV - Model 1 Jun 3, 2023 Download Resume #1 Romanian CV - Model 1 Jun 3, 2023 Download I am a skilled professional with expertise in web development and programming. With a strong foundation in various web platforms and programming languages, I possess the ability to create dynamic and user-friendly websites. My proficiency extends to page builders and web development programs, enabling me to design and customize web pages effectively. I have experience working with a range of software and tools, including photo editing and video editing programs. My knowledge extends to streaming programs and other widely used applications, such as Microsoft Office and Google Suite. With a strong technical aptitude and adaptability, I am confident in my ability to contribute to innovative projects and deliver exceptional results. I am eager to leverage my skills and experiences to make a meaningful impact. Contact Form Submit Socials ● Google Site: sites.google.com\/view\/denis-marginas ● Google Form: forms.gle\/vTHeLVkc1TwXCxBJA ● Facebook Page: facebook.com\/denismarginas09 ● Linkedin: linkedin.com\/in\/denismarginas09 ● Github: github.com\/denismarginas ● CV English: drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view ● CV Romanian: drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/personal-images\/dm-personal-image-0.webp"
    },
    {
        "page": "education-experience.html",
        "meta-title": "Education Experience",
        "meta-description": "Discover my educational journey from high school to university, including courses and diplomas attained along the way.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Educational experience path High School Emil Racoviță Technical University of Cluj-Napoca UTCNBM High School Emil Racoviță 14.09.2012 18.07.2016 Profession: Mathematics-Informatics Mathematics ICT Computer science C++ HTML CSS Visual Fox Timeline: 4 Years Technical University of Cluj-Napoca UTCNBM 01.10.2016 14.07.2019 Profession: Mathematics-Informatics Assembly language programming Computational logic Python programming C programming Computer networking Databases Advanced database management systems Mathematics Timeline: 3 Years Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/education\/logo-high-school-emil-racovita.jpg"
    },
    {
        "page": "employee-experience.html",
        "meta-title": "Employee Experience",
        "meta-description": "Explore my professional journey through my employ experience, where I showcase a chronological record of my employment history. Discover insights into my roles, responsibilities, and significant contributions at various companies, along with dates and key attributes.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Experience as an employee Pia Soft Product Netex Romania Enlivy Mentor Marketing Experts Pia Soft Product 16.10.2019 18.11.2022 Work Function: Full-Stack Web Developer Photo-Video Editor Developed and maintained web applications, troubleshooting, creating documentation, cPanel management, phpmyAdmin, XAMPP, and hosting with Romarg Proficient in utilizing TPL, PHP, SQL, JavaScript, jQuery, CSS, and HTML for application development and usage Create presentation sites and online stores in Wordpress and Prestashop, with a focus on optimizing SEO Create video-photo content for promotional purposes, including banners, logos, video ads, 2D\/3D animation, using tools such as Sony Vegas, Adobe After Effects, Photopea, and Xara Photo Skilled in using the Windows operating system and the Office suite Work Time: 3 Years 1 Month full-time 8h 17.10.2019 - 07.12.2021 part-time 4h 07.12.2021 - 18.11.2022 Remote On-site Hybrid Netex Romania 07.12.2021 05.04.2023 Work Function: Front-End Developer Developed and maintained WordPress sites, troubleshooting, creating documentation Designed various web applications, including Newsletter Mail Translated design from Zeplin into static pages using: Node.js, JavaScript, jQuery, Bootstrap, SASS, CSS and HTML, GitLab Attend conferences in English and present completed tasks on Google Meet Familiar with Linux commands and interface, as well as working with the LibreOffice package Work Time: 1 Year 4 Months full-time 8h 07.12.2021 - 05.04.2023 Remote Enlivy 01.05.2023 31.05.2023 Work Function: Junior Wordpress Developer Developed blocks and pages for a custom WordPress theme using PhpStorm and GitHub Translated designs from a Figma project into functional web pages Utilized Trello for task management and Slack, along with Zoom, for efficient team communication Utilized Prepros 7 to compile the SCSS code for streamlined development Work Time: 1 Month full-time 8h 01.05.2023 - 31.05.2023 Remote Mentor Marketing Experts 26.01.2024 In progress Work Function: Web page designer Developing websites in Wordpress using Elementor and other addons\/plugins for Elementor Translated designs from a Figma project into functional web pages using Elementor Utilized Trello for task management, along with Zoom and Google Meets, for efficient team communication full-time 8h 26.01.2024 - In progress Remote Note: Please be aware that this is not an completed list, and there may be additional professional experiences not mentioned here. If you have specific inquiries about my work history or would like more details, feel free to reach out. 2019 Jan.2019 Feb.2019 Mar.2019 Apr.2019 May.2019 Jun.2019 Jul.2019 Aug.2019 Sep.2019 Oct.2019 Nov.2019 Dec.2019 2020 Jan.2020 Feb.2020 Mar.2020 Apr.2020 May.2020 Jun.2020 Jul.2020 Aug.2020 Sep.2020 Oct.2020 Nov.2020 Dec.2020 2021 Jan.2021 Feb.2021 Mar.2021 Apr.2021 May.2021 Jun.2021 Jul.2021 Aug.2021 Sep.2021 Oct.2021 Nov.2021 Dec.2021 2022 Jan.2022 Feb.2022 Mar.2022 Apr.2022 May.2022 Jun.2022 Jul.2022 Aug.2022 Sep.2022 Oct.2022 Nov.2022 Dec.2022 2023 Jan.2023 Feb.2023 Mar.2023 Apr.2023 May.2023 Jun.2023 Jul.2023 Aug.2023 Sep.2023 Oct.2023 Nov.2023 Dec.2023 2024 Jan.2024 Feb.2024 Mar.2024 Apr.2024 May.2024 Jun.2024 Jul.2024 Aug.2024 Sep.2024 Oct.2024 Nov.2024 Dec.2024 2019 Jan.2019 Feb.2019 Mar.2019 Apr.2019 May.2019 Jun.2019 Jul.2019 Aug.2019 Sep.2019 Oct.2019 Nov.2019 Dec.2019 2020 Jan.2020 Feb.2020 Mar.2020 Apr.2020 May.2020 Jun.2020 Jul.2020 Aug.2020 Sep.2020 Oct.2020 Nov.2020 Dec.2020 2021 Jan.2021 Feb.2021 Mar.2021 Apr.2021 May.2021 Jun.2021 Jul.2021 Aug.2021 Sep.2021 Oct.2021 Nov.2021 Dec.2021 2022 Jan.2022 Feb.2022 Mar.2022 Apr.2022 May.2022 Jun.2022 Jul.2022 Aug.2022 Sep.2022 Oct.2022 Nov.2022 Dec.2022 2023 Jan.2023 Feb.2023 Mar.2023 Apr.2023 May.2023 Jun.2023 Jul.2023 Aug.2023 Sep.2023 Oct.2023 Nov.2023 Dec.2023 2024 Jan.2024 Feb.2024 Mar.2024 Apr.2024 May.2024 Jun.2024 Jul.2024 Aug.2024 Sep.2024 Oct.2024 Nov.2024 Dec.2024 Total Work Experience: 4 years, 7 months Total Work Timeline: 3 years, 10 months Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/piasoftproduct\/logo\/logo.png"
    },
    {
        "page": "experience.html",
        "meta-title": "Experience",
        "meta-description": "Experience a captivating journey through my professional work from 2019 to 2023 in this short video. From a captivating intro to web development, photo editing, and video editing, witness my diverse expertise in just under two minutes.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Experience I have knowledge and skills in these categories: ● Web Platforms: WordPress, Prestashop, Google Site ● Page builders: Elementor, WpBakery, Gutenberg ● Operating systems: Windows, Linux ● Languages: PHP, TPL, SQL, JS, HTML, CSS, SASS\/SCSS, Python, C\/C++ ● Libraries: jQuery 3, Bootstrap 5, Font Awesome 4, MaterialDesignWebfront ● Web development programs: cPanel, HeidiSQL, phpMyAdmin, XAMPP, GitLab, GitHub, Visual Studio Code, PhpStorm, PyCharm, Node.js, Prepros, Figma ● Photo editing programs: Photopea, Photoshop, Paint.net, Xara Photo, Topaz Gigapixel ● Video editing programs: Adobe After Effects, Sony Vegas Pro, Topaz Enhance, BCC, RSMB, Sapphire, Ignite Pro, Optical Flares, Plexus, Particular, Element 3d, 3D Camera Tracking ● 3D Programs: Blender ● Streaming programs: OBS, Google Meet, Zoom ● Other programs: Microsoft Excel, Microsoft Word, Microsoft PowerPoint, Google Sheet, Google Docs, Google Slides Summary Experience Employee Experience Projects Catalog Projects Web Development Projects Showcase of websites and online shops I have created, featuring engaging designs and seamless functionality. Visual Media Projects Collection of visually captivating projects showcasing my expertise in graphic design, photo editing, and video production. Miscellaneous Projects Assortment of non-profit initiatives and personal passion projects, reflecting my diverse range of creative endeavors. 0:00 \/ 1x Portfolio Showcase Experience a captivating journey through my professional work from 2019 to 2023 in this short video. From a captivating intro to web development, photo editing, and video editing, witness my diverse expertise in just under two minutes. Watch on YouTube Video Timeline: 00:00 - 00:04 - Intro 00:04 - 00:55 - Web Development 00:55 - 01:14 - Photo Editing 01:14 - 01:52 - Video Editing 01:52 - 01:56 - Otro DESIGN I can create a responsive website using HTML and CSS\/SCSS to ensure that all your pages look and fit perfectly on every device. Additionally, you have the freedom to choose any theme or design that you would like to implement according to your preferences. SEO Boost your website's search engine traffic with my SEO expertise. I'll optimize all pages with keyword-specific meta titles and descriptions, and generate a sitemap for improved visibility. DEVELOPMENT I specialize in implementing modules, developing web applications, and creating functions for platforms such as Prestashop and WordPress. My expertise covers a range of languages including PHP, TPL, HTML, CSS, JavaScript, and MySQL. SUPPORT I offer comprehensive solutions and assistance for all your project needs, helping you achieve the desired results. For further information, please use the contact form available on the website's contact page. Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/personal-images\/dm-personal-image-0.webp"
    },
    {
        "page": "home.html",
        "meta-title": "Portfolio",
        "meta-description": "My name is Denis Ionut Marginas, I'm 25-year-old, and I've been working as a full-stack web developer and photo-video editor since 2019. Before entering the web development field, I worked as a freelance video editor, specializing in editing videos for video games.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact About Me My name is Denis Ionuț Mărginaș, I'm 26-year-old, and I've been working as a full-stack web developer and photo-video editor since 2019. Before entering the web development field, I worked as a freelance video editor, specializing in editing videos for video games. After completing my university studies in Mathematics and Informatics, I shifted my focus to web development and began pursuing a career in that field. More Details Projects Web Development Projects Showcase of websites and online shops I have created, featuring engaging designs and seamless functionality. Visual Media Projects Collection of visually captivating projects showcasing my expertise in graphic design, photo editing, and video production. Miscellaneous Projects Assortment of non-profit initiatives and personal passion projects, reflecting my diverse range of creative endeavors. WORK EXPERIENCE Since 2019, I have actively immersed myself in numerous web projects, collaborating with diverse companies to create a wide range of online solutions. Throughout this period, my expertise has encompassed the development of presentation sites, online stores, web applications, SEO optimization, as well as web design. Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/personal-images\/dm-personal-image-1.webp"
    },
    {
        "page": "miscellaneous-projects.html",
        "meta-title": "Miscellaneous Projects",
        "meta-description": "Category: Miscellaneous Projects. Assortment of non-profit initiatives and personal passion projects, reflecting my diverse range of creative endeavors.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Miscellaneous Projects Miscellaneous Projects Cekan - Case Study Translated Figma web design for the Case Study section on the cekan.ca website, ensuring 99% accuracy in replicating the responsiv Miscellaneous Projects Promotional campaigns - Tndc In collaboration with TNDC, I developed two website pages, each dedicated to a promotional campaign for Snickers and Orbit (promot Miscellaneous Projects Vreau Alpin I made several significant changes to this site as web design enhancements, content editor, and the addition of new functionalitie Miscellaneous Projects Augustin Nail Trainer Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Miscellaneous Projects Round Selfie Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Miscellaneous Projects Special Events Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Miscellaneous Projects Prisma Nord The online shop with over 150 products is built on Prestashop 1.7. To add products to the cart, a price and a quantity with a non- Miscellaneous Projects Denis Marginas Simple portfolio website is made with Google Site. Experience the artistry behind my meticulously crafted media content for this c Miscellaneous Projects Striker Production Main activity of the Striker Production is the video editing at different video games and real life footage. In addition to creati Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/cekan\/logo\/logo.png"
    },
    {
        "page": "project-aatoysfurnitures.html",
        "meta-title": "A&A Toys & Furniture",
        "meta-description": "This is one of the first websites I have created in my career. When I started working on it, the website was already 25% complete. I took over from the previous developer and familiarized myself with the intricacies of WordPress and the Elementor Plugin environment along the way.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development A&A Toys & Furniture This is one of the first websites I have created in my career. When I started working on it, the website was already 25% complete. I took over from the previous developer and familiarized myself with the intricacies of WordPress and the Elementor Plugin environment along the way. Web Development Projects Website: www.aatoys.ro Platform: Wordpress Languages: HTML, CSS, JS, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Teamwork, Individual Web Project Status: Done presentation website web content web design Worked at: Pia Soft Product Date: 10.2019 - 11.2019 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/aatoysfurnitures\/web\/home\/home.webp"
    },
    {
        "page": "project-acvaticbebeclub.html",
        "meta-title": "Acvatic Bebe Club",
        "meta-description": "A website has been created using WordPress to provide subscriptions for teaching babies and children how to swim. The site features a blog with articles, and nearly all the content on the website is available in two languages: English and Romanian. My work on this project involved editing pages and translating content from Romanian to English using the translated text provided by the client.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Acvatic Bebe Club A website has been created using WordPress to provide subscriptions for teaching babies and children how to swim. The site features a blog with articles, and nearly all the content on the website is available in two languages: English and Romanian. My work on this project involved editing pages and translating content from Romanian to English using the translated text provided by the client. Web Development Projects Website: www.acvaticbebeclub.ro Platform: Wordpress Languages: HTML, CSS, JS, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Teamwork, Individual Web Project Status: Done presentation website web content Worked at: Pia Soft Product Date: 05.2021 - 07.2021 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/acvaticbebeclub\/web\/home\/home.webp"
    },
    {
        "page": "project-agramix.html",
        "meta-title": "Agramix",
        "meta-description": "The online shop for tools, machine parts, agricultural and industrial equipment is made in Prestashop 1.7. The theme on which the site was built has been changed a lot in appearance through HTML, CSS, JS. For products that cannot be ordered, 2 buttons have been created: one to call for the product and another to send an email to request information about the product. The contact form was created by editing TPL, HTML, CSS, and an iframe with a WordPress page with the Contact Form 7 module. The products on the site were imported through a CSV file from the previous site (Wordpress). This site is permanently connected to the eMAG marketplace through a module, in other words it has a feed through API.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Visual Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 37 photos and 3 videos that showcase my expertise in delivering impactful visuals for social media promotion. From stunning imagery to engaging videos, each piece is meticulously created to elevate your brand's online presence. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo video 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x Agramix The online shop for tools, machine parts, agricultural and industrial equipment is made in Prestashop 1.7. The theme on which the site was built has been changed a lot in appearance through HTML, CSS, JS. For products that cannot be ordered, 2 buttons have been created: one to call for the product and another to send an email to request information about the product. The contact form was created by editing TPL, HTML, CSS, and an iframe with a WordPress page with the Contact Form 7 module. The products on the site were imported through a CSV file from the previous site (Wordpress). This site is permanently connected to the eMAG marketplace through a module, in other words it has a feed through API. Web Development Projects Visual Media Projects Website: www.agramix.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Modules: Creative Elements - Elementor Website Builder, ETS Contact Form 7, Joli Search - advanced visual search, Cron Jobs, eMAG Marketplace PrestaShop Integration by Zitec, MobilPay, FAN Courier, Facebook Pixel Products Feed Project Collaboration: Individual Web Project Status: Done Facebook: www.facebook.com\/agramix.mm Instagram: www.instagram.com\/agramix.ro\/ Media Platforms: Photopea, Xara Photo & Graphic Designer, Paint.net, Sony Vegas online shop web content web design media image media video web maintenance seo optimization Worked at: Pia Soft Product Date: 07.2020 - 12.2021 web media-web photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/agramix\/web\/home\/home.webp"
    },
    {
        "page": "project-agromir-sh.html",
        "meta-title": "Agromir Second-Hand",
        "meta-description": "The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to the cart, but there is 1 button to contact by phone for the product and 1 button to contact by email. The form was created by editing TPL, HTML, CSS and the Wordpress platform with the Contact Form 7 module and a JS script. The site has implemented modules from Prestashop Addons such as JoliSearch, Amazing gallery and other modules purchased or adapted free of charge for the site.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Agromir Second-Hand The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to the cart, but there is 1 button to contact by phone for the product and 1 button to contact by email. The form was created by editing TPL, HTML, CSS and the Wordpress platform with the Contact Form 7 module and a JS script. The site has implemented modules from Prestashop Addons such as JoliSearch, Amazing gallery and other modules purchased or adapted free of charge for the site. Web Development Projects Website: www.anvelope-sh.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Modules: Creative Elements - Elementor Website Builder, ETS Contact Form 7, Pretty URLs, Joli Search - advanced visual search, Facebook Pixel Products Feed, Google Merchant Center Feed Project Collaboration: Individual Web Project Status: Done online shop web content web design web maintenance Worked at: Pia Soft Product Date: 09.2020 - 11.2022 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/agromir-sh\/web\/home\/home.webp"
    },
    {
        "page": "project-agromir.html",
        "meta-title": "Agromir",
        "meta-description": "The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to the cart, but there are 3 buttons to contact by phone for the product and 1 button to contact by email. The contact form was created by editing TPL, HTML, CSS, and an iframe with a WordPress page with the Contact Form 7 module. The site has implemented modules from Prestashop Addons such as JoliSearch, Amazing gallery and other modules purchased or adapted free of charge for the site. A button is displayed to contact via Whatsapp for products through a module that has been modified via JS to display various texts at a certain time.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Visual Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 165 photos and 8 videos that showcase my expertise in delivering impactful visuals for social media promotion. From stunning imagery to engaging videos, each piece is meticulously created to elevate your brand's online presence. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo video 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x Agromir The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to the cart, but there are 3 buttons to contact by phone for the product and 1 button to contact by email. The contact form was created by editing TPL, HTML, CSS, and an iframe with a WordPress page with the Contact Form 7 module. The site has implemented modules from Prestashop Addons such as JoliSearch, Amazing gallery and other modules purchased or adapted free of charge for the site. A button is displayed to contact via Whatsapp for products through a module that has been modified via JS to display various texts at a certain time. Web Development Projects Visual Media Projects Website: www.agromir.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Modules: Creative Elements - Elementor Website Builder, ETS Contact Form 7, Pretty URLs, Joli Search - advanced visual search, Facebook Pixel Products Feed, Google Merchant Center Feed Project Collaboration: Individual Web Project Status: Done Facebook: www.facebook.com\/cauciucuriagricole Instagram: www.instagram.com\/agromir_insta\/ Media Platforms: Photopea, Xara Photo & Graphic Designer, Paint.net, Sony Vegas, After Effects, Blender online shop web content web design media image media video web maintenance seo optimization Worked at: Pia Soft Product Date: 02.2020 - 11.2022 web media-web photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/agromir\/web\/home\/web_0.webp"
    },
    {
        "page": "project-amorino.html",
        "meta-title": "Amorino",
        "meta-description": "The website, specializing in selling dresses for girls, is built using Prestashop 1.7. Customers have the option to make payments using their cards through the PayU module. To create the contact form, I customized TPL, HTML, and CSS elements, and integrated an iframe with a WordPress page, utilizing the Contact Form 7 module.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Amorino The website, specializing in selling dresses for girls, is built using Prestashop 1.7. Customers have the option to make payments using their cards through the PayU module. To create the contact form, I customized TPL, HTML, and CSS elements, and integrated an iframe with a WordPress page, utilizing the Contact Form 7 module. Web Development Projects Website: www.amorino.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Project Collaboration: Individual Web Project Status: Done Media Platforms: Xara Photo & Graphic Designer, Paint.net online shop web content web design web maintenance seo optimization Worked at: Pia Soft Product Date: 03.2020 - 10.2020 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/amorino\/web\/home\/home.webp"
    },
    {
        "page": "project-augustinnailtrainer.html",
        "meta-title": "Augustin Nail Trainer",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media Augustin Nail Trainer Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Miscellaneous Projects Project Collaboration: Individual Facebook: www.facebook.com\/augustin.andradaandreea Media Platforms: Photopea media image Worked as: Freelancer Date: 01.2023 - 02.2023 photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/augustinnailtrainer\/media\/nails-1\/nail-1.webp"
    },
    {
        "page": "project-axacompany.html",
        "meta-title": "AXA Company",
        "meta-description": "AXA Company proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content AXA Company AXA Company proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: axacompany.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Individual Web Project Status: Done Media Platforms: Photopea presentation website web content web design Worked at: Pia Soft Product Date: 11.2021 - 12.2021 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/axacompany\/web\/home\/home.webp"
    },
    {
        "page": "project-boneamed.html",
        "meta-title": "Bonea Med",
        "meta-description": "This project involved creating a clinic website with appointment booking functionality. I used the Booked module in a WordPress website. Clients can book appointments with specific doctors, and doctors can access, edit, and add appointments.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Bonea Med This project involved creating a clinic website with appointment booking functionality. I used the Booked module in a WordPress website. Clients can book appointments with specific doctors, and doctors can access, edit, and add appointments. Web Development Projects Website: www.boneamed.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7, Booked Project Collaboration: Individual Web Project Status: Done Media Platforms: Photopea presentation website web content web design Worked at: Pia Soft Product Date: 06.2021 - 06.2022 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/boneamed\/web\/home\/home.webp"
    },
    {
        "page": "project-brbhome.html",
        "meta-title": "BRB Home",
        "meta-description": "This was one of the first websites I created using WordPress. The purpose of the project was to develop a presentation website aimed at promoting furniture services and enabling customers to easily get in touch with the company.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content BRB Home This was one of the first websites I created using WordPress. The purpose of the project was to develop a presentation website aimed at promoting furniture services and enabling customers to easily get in touch with the company. Web Development Projects Website: www.brbhome.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Individual Web Project Status: Done presentation website web content web design Worked at: Pia Soft Product Date: 11.2019 - 12.2019 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/brbhome\/web\/home\/home.webp"
    },
    {
        "page": "project-brisascents.html",
        "meta-title": "Brisa Scents",
        "meta-description": "I have continued this project from a stage of 20% - 30% done, a WordPress website for perfume and spray sales. User-friendly interface, diverse product collection. Secure transactions, detailed descriptions. Contact page for customer support.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Brisa Scents I have continued this project from a stage of 20% - 30% done, a WordPress website for perfume and spray sales. User-friendly interface, diverse product collection. Secure transactions, detailed descriptions. Contact page for customer support. Web Development Projects Website: www.brisa-scents.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Woocommerce, Contact Form 7 Project Collaboration: Individual Web Project Status: Done online shop web content Worked at: Pia Soft Product Date: 10.2020 - 12.2020 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/brisascents\/web\/home\/home.webp"
    },
    {
        "page": "project-busvip.html",
        "meta-title": "Bus-Vip",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x Bus-Vip Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Facebook: www.facebook.com\/curseocazionalebusvip Media Platforms: Photopea, Xara Photo & Graphic Designer, Paint.net, Sony Vegas, After Effects media image Worked at: Pia Soft Product Date: 01.2020 - 11.2022 photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/busvip\/media\/banners-1-1\/banner-1-1-01.webp"
    },
    {
        "page": "project-cadredidactice.html",
        "meta-title": "Centrul de Resurse Educationale",
        "meta-description": "Centrul de Resurse Educationale proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The purpose of this application is for users to be able to send pdf documents (magazines and books) to be uploaded to the site in the respective section, or they can choose to sign up for projects (such as contests) dedicated to teachers with different dates, including pdf files. The files that are sent to the site are saved in the hosting. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Centrul de Resurse Educationale Centrul de Resurse Educationale proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The purpose of this application is for users to be able to send pdf documents (magazines and books) to be uploaded to the site in the respective section, or they can choose to sign up for projects (such as contests) dedicated to teachers with different dates, including pdf files. The files that are sent to the site are saved in the hosting. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: www.cadredidactice.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Individual Web Project Status: Done presentation website web content web design web maintenance Worked at: Pia Soft Product Date: 03.2020 - 11.2022 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/cadredidactice\/web\/home\/home.webp"
    },
    {
        "page": "project-cafeagano.html",
        "meta-title": "Cafea Gano",
        "meta-description": "WordPress website created for an online shop specializing in natural supplements and coffee. The shop was made using the Woocommerce module.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Cafea Gano WordPress website created for an online shop specializing in natural supplements and coffee. The shop was made using the Woocommerce module. Web Development Projects Website: www.cafeagano.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7, Woocommerce Project Collaboration: Individual Web Project Status: Done presentation website web content web design web maintenance Worked at: Pia Soft Product Date: 03.2020 - 07.2020 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/cafeagano\/web\/home\/home.webp"
    },
    {
        "page": "project-carconcordia.html",
        "meta-title": "Concordia CAR",
        "meta-description": "Concordia proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Concordia CAR Concordia proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: www.carconcordia.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: GoodLayers Page Builder, Contact Form 7, Slider Revolution Project Collaboration: Individual presentation website web content web design Worked at: Pia Soft Product Date: 06.2021 - 06.2021 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/carconcordia\/web\/home\/home.webp"
    },
    {
        "page": "project-casadarius-presentation.html",
        "meta-title": "Casa Darius",
        "meta-description": "Casa Darius proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Casa Darius Casa Darius proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: www.casadarius.ro\/prezentare Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Individual Web Project Status: Done presentation website web content web design web maintenance Worked at: Pia Soft Product Date: 01.2020 - 07.2020 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/casadarius-presentation\/web\/home\/home.webp"
    },
    {
        "page": "project-casadarius-shop.html",
        "meta-title": "Casa Darius",
        "meta-description": "The online shop for furniture is made in Prestashop 1.7 with integrated payment method, via MobilPay. The products cannot be added to the cart, but there are buttons to contact via phone for the specific store location. It have more than 30 new products with around 8-10 edited photos, products added in an empty room with pot decorations. ",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Visual Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 131 photos and 3 videos that showcase my expertise in delivering impactful visuals for social media promotion. From stunning imagery to engaging videos, each piece is meticulously created to elevate your brand's online presence. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo video 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x Casa Darius The online shop for furniture is made in Prestashop 1.7 with integrated payment method, via MobilPay. The products cannot be added to the cart, but there are buttons to contact via phone for the specific store location. It have more than 30 new products with around 8-10 edited photos, products added in an empty room with pot decorations. Web Development Projects Visual Media Projects Website: www.casadarius.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Modules: Creative Elements - Elementor Website Builder, ETS Contact Form 7, Pretty URLs, Magic Zoom Plus, Cron Jobs, Facebook Pixel Products Feed Project Collaboration: Individual Web Project Status: Done Facebook: www.facebook.com\/casadariuscluj\/ Instagram: www.instagram.com\/casadariusturda\/ Facebook 1: www.facebook.com\/CanapeleTurda\/ Facebook 2: www.instagram.com\/casadariusturda\/ Instagram 1: www.instagram.com\/casadariusturda\/ Instagram 2: www.instagram.com\/casadariusludus\/ Media Platforms: Photopea, Xara Photo & Graphic Designer, Paint.net, Sony Vegas, After Effects online shop web content web design web maintenance seo optimization Worked at: Pia Soft Product Date: 07.2020 - 11.2022 web media-web photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/casadarius-shop\/web\/home\/home.webp"
    },
    {
        "page": "project-cekan.html",
        "meta-title": "Cekan - Case Study",
        "meta-description": "Translated Figma web design for the Case Study section on the cekan.ca website, ensuring 99% accuracy in replicating the responsive look across various screen sizes. Utilized HTML and SCSS to implement the page design, using Prepro to compile SCSS into CSS. Managed the code using PhpStorm. Completed the project in 4 days, dedicating 2-4 hours of work each day.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Cekan - Case Study Translated Figma web design for the Case Study section on the cekan.ca website, ensuring 99% accuracy in replicating the responsive look across various screen sizes. Utilized HTML and SCSS to implement the page design, using Prepro to compile SCSS into CSS. Managed the code using PhpStorm. Completed the project in 4 days, dedicating 2-4 hours of work each day. Web Development Projects Miscellaneous Projects Website: cekan.ca\/case-study\/ Platform: Wordpress Languages: HTML, CSS, SASS, JS Project Collaboration: Individual Web Project Status: Done web design Worked as: Freelancer Date: 01.2024 - 02.2024 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/cekan\/web\/home\/home.webp"
    },
    {
        "page": "project-ceramicevo.html",
        "meta-title": "Ceramic & Stone Evolutione",
        "meta-description": "Evolutione proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for the business. The customers can't buy the products, but with the intended buttons on the product page, they can contact the supplier via phone or with the product ask form. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Ceramic & Stone Evolutione Evolutione proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for the business. The customers can't buy the products, but with the intended buttons on the product page, they can contact the supplier via phone or with the product ask form. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: www.ceramicevo.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Project Collaboration: Individual Web Project Status: Done online shop web content Worked at: Pia Soft Product Date: 05.2020 - 07.2020 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/ceramicevo\/web\/home\/home.webp"
    },
    {
        "page": "project-copiatoarealbaiulia.html",
        "meta-title": "Copiatoare Alba Iulia",
        "meta-description": "Copiatoare Alba Iulia proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Copiatoare Alba Iulia Copiatoare Alba Iulia proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: www.copiatoarealbaiulia.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Individual Web Project Status: Done Media Platforms: Xara Photo & Graphic Designer, Paint.net presentation website web content web design Worked at: Pia Soft Product Date: 11.2019 - 12.2019 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/copiatoarealbaiulia\/web\/home\/home.webp"
    },
    {
        "page": "project-covoarealex.html",
        "meta-title": "Covoare Alex",
        "meta-description": "The online shop for different types and models of carpets, is made in Prestashop 1.7 with integrated payment method, via MobilPay. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Covoare Alex The online shop for different types and models of carpets, is made in Prestashop 1.7 with integrated payment method, via MobilPay. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: www.covoarealex.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Modules: Creative Elements - Elementor Website Builder, ETS Contact Form 7, Facebook Pixel Products Feed Project Collaboration: Individual Web Project Status: Done Media Platforms: Photopea online shop web content web design web maintenance Worked at: Pia Soft Product Date: 04.2021 - 11.2021 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/covoarealex\/web\/home\/home.webp"
    },
    {
        "page": "project-cursuristudenti-bachelor-s-thesis.html",
        "meta-title": "Student Courses - Bachelor's thesis",
        "meta-description": "This is my Bachelor's thesis named 'Cursuri Studenti - Lucrare Licenta' where I aim was to develop a website catering specifically to students who require access to various courses or specific course materials in text format for reports or projects. The website primarily facilitates the uploading of course content in image format, which is then converted and stored in text format on the site. Additionally, users have the option to edit their personal data, customize their accounts with a logo, and, as administrators, manage both user accounts and course materials. <br><\/br> Technologies used: Hypertext Markup Language (HTML), Zurb Foundation, JavaScript, Cascading Style Sheets (CSS), Hypertext Preprocessor (PHP), XAMPP, Tesseract OCR, HeidiSQL",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development 1 \/ 20 2 \/ 20 3 \/ 20 4 \/ 20 5 \/ 20 6 \/ 20 7 \/ 20 8 \/ 20 9 \/ 20 10 \/ 20 11 \/ 20 12 \/ 20 13 \/ 20 14 \/ 20 15 \/ 20 16 \/ 20 17 \/ 20 18 \/ 20 19 \/ 20 20 \/ 20 Student Courses - Bachelor's thesis This is my Bachelor's thesis named 'Cursuri Studenti - Lucrare Licenta' where I aim was to develop a website catering specifically to students who require access to various courses or specific course materials in text format for reports or projects. The website primarily facilitates the uploading of course content in image format, which is then converted and stored in text format on the site. Additionally, users have the option to edit their personal data, customize their accounts with a logo, and, as administrators, manage both user accounts and course materials. Technologies used: Hypertext Markup Language (HTML), Zurb Foundation, JavaScript, Cascading Style Sheets (CSS), Hypertext Preprocessor (PHP), XAMPP, Tesseract OCR, HeidiSQL Web Development Projects Miscellaneous Projects Languages: HTML, CSS, JS, PHP, Pyhon, SQL Project Collaboration: Individual Web Project Status: Done Bachelor's thesis personal Date: 05.2019 - 07.2019 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/cursuristudenti-lucrarelicenta\/web\/home\/home.webp"
    },
    {
        "page": "project-dabo-sm-bm.html",
        "meta-title": "Dabo - SM & BM",
        "meta-description": "Here is my media content for the promotion of Dabo Satu Mare & Dabo Baia Mare during the pandemic, which took place in 2020. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media 0:00 \/ 1x Dabo - SM & BM Here is my media content for the promotion of Dabo Satu Mare & Dabo Baia Mare during the pandemic, which took place in 2020. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Media Platforms: Xara Photo & Graphic Designer, Paint.net, Sony Vegas media image Worked at: Pia Soft Product Date: 03.2020 - 05.2020 photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/dabo-sm-bm\/media\/banners-1\/banner-1.webp"
    },
    {
        "page": "project-denismarginas.html",
        "meta-title": "Denis Marginas",
        "meta-description": "Simple portfolio website is made with Google Site. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Visual Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 19 photos that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo 0:00 \/ 1x 0:00 \/ 1x Denis Marginas Simple portfolio website is made with Google Site. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Web Development Projects Visual Media Projects Miscellaneous Projects Website: sites.google.com\/view\/denis-marginas Platform: Google Site Project Collaboration: Individual Web Project Status: Done Facebook: www.facebook.com\/denismarginas09 YouTube: www.youtube.com\/channel\/UCZGb7hnkyawMgnSO9T-rnnQ Google Form: https:\/\/forms.gle\/vTHeLVkc1TwXCxBJA Linkedin: www.linkedin.com\/in\/denismarginas09 Google Site: sites.google.com\/view\/denis-marginas\/portfolio Resume English: drive.google.com\/file\/d\/1-RYU6uYovCR_LT48nD7CZ1sa6xQ8QJh_\/view?fbclid=IwAR2uM1bsxIRykbxASFEuRVHECNNLfcty7zcoMquzH4ctG912jSLQ0UEfR4M Resume Romanian: drive.google.com\/file\/d\/1_gPqX2MgLJD7bYCgZ977GHX25pVC_ihz\/view?fbclid=IwAR31XhWoDXsDa543gAtcJDrJd0zJIh72zpp35YQeHHTw8mbjnFVwyo9ueng Media Platforms: Photopea, Xara Photo & Graphic Designer, Paint.net, Sony Vegas, After Effects presentation website web content web design media image media video personal Date: 06.2020 - 05.2024 web photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/denismarginas\/web\/home\/home.webp"
    },
    {
        "page": "project-dsautocenter.html",
        "meta-title": "DS Auto Center",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media 0:00 \/ 1x DS Auto Center Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Facebook: www.facebook.com\/DSAutoCenterBuzau Video: www.facebook.com\/DSAutoCenterBuzau\/videos\/554819492317663 Media Platforms: Photopea, Sony Vegas media image media video Worked at: Pia Soft Product Date: 03.2020 - 03.2020 photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/dsautocenter\/media\/banners\/banner-1.webp"
    },
    {
        "page": "project-freymobdesign.html",
        "meta-title": "FreyMob Design",
        "meta-description": "The online shop for furniture is made in Prestashop 1.6. The site has 3 languages, and 2 currencies. The products on this application cannot be bought, but 2 buttons are provided on the product page: one to contact the distributor with a phone and the other to display the offer request form. Payment for purchases can be made only by cash on delivery, and confirmation of delivery is made by the merchant",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development FreyMob Design The online shop for furniture is made in Prestashop 1.6. The site has 3 languages, and 2 currencies. The products on this application cannot be bought, but 2 buttons are provided on the product page: one to contact the distributor with a phone and the other to display the offer request form. Payment for purchases can be made only by cash on delivery, and confirmation of delivery is made by the merchant Web Development Projects Website: www.freymobdesign.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Modules: Facebook Pixel Products Feed Project Collaboration: Individual Web Project Status: Done online shop web content web design web maintenance Worked at: Pia Soft Product Date: 10.2020 - 03.2021 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/freymobdesign\/web\/home\/home.webp"
    },
    {
        "page": "project-gamadametal.html",
        "meta-title": "Gamada Metal",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media Gamada Metal Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Facebook: www.facebook.com\/gamadametalsrl Media Platforms: Photopea media image Worked at: Pia Soft Product Date: 11.2021 - 12.2021 photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/gamadametal\/media\/card\/card-1.webp"
    },
    {
        "page": "project-hartkeepyouthaton.html",
        "meta-title": "HART - Keep your hat on",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media 0:00 \/ 1x HART - Keep your hat on Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Facebook: www.facebook.com\/atelieruldepalarii Media Platforms: Xara Photo & Graphic Designer, Paint.net, Sony Vegas media photo Worked at: Pia Soft Product Date: 02.2020 - 02.2020 photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/hartkeepyouthaton\/media\/slider-images\/slider-item-01.webp"
    },
    {
        "page": "project-ilnicelectric.html",
        "meta-title": "Ilnic Electric",
        "meta-description": "Ilnic Electric proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Ilnic Electric Ilnic Electric proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: www.ilnic.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7, Slider Revolution Project Collaboration: Individual Web Project Status: Done Media Platforms: Photopea presentation website web content web design Worked at: Pia Soft Product Date: 01.2022 - 02.2022 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/ilnicelectric\/web\/home\/home.webp"
    },
    {
        "page": "project-lavplast-ambalajelavplast.html",
        "meta-title": "Ambalaje Lavplast",
        "meta-description": "The online shop, built on Prestashop 1.7, offers a wide range of products. Customers can conveniently make payments using their cards through the MobilPay module. To create the contact form, I edited TPL, HTML, and CSS, and integrated an iframe with a WordPress page utilizing the Contact Form 7 module.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Ambalaje Lavplast The online shop, built on Prestashop 1.7, offers a wide range of products. Customers can conveniently make payments using their cards through the MobilPay module. To create the contact form, I edited TPL, HTML, and CSS, and integrated an iframe with a WordPress page utilizing the Contact Form 7 module. Web Development Projects Website: www.ambalaje-lavplast.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Project Collaboration: Individual Web Project Status: Done Media Platforms: Xara Photo & Graphic Designer, Paint.net online shop web content web design Worked at: Pia Soft Product Date: 06.2020 - 07.2020 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/ambalajelavplast\/web\/home\/home.webp"
    },
    {
        "page": "project-lavplast-lavmag.html",
        "meta-title": "Lavmag",
        "meta-description": "The online shop for a wide range of products is built using Prestashop 1.7. All products are regularly updated and uploaded through a feed sourced from another store. To accomplish this, I developed custom PHP scripts from scratch to handle various feed actions. These scripts efficiently open the CSV feed, create categories, brands, and products, as well as upload and update product data, including prices. Notably, the prices of the products are adjusted with a higher percentage compared to the values received from the feed. During the latest update, this store successfully managed over 4000 products. Customers can conveniently make payments using their cards through the MobilPay module. To create the contact form, I edited TPL, HTML, and CSS, and integrated an iframe with a WordPress page utilizing the Contact Form 7 module.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Lavmag The online shop for a wide range of products is built using Prestashop 1.7. All products are regularly updated and uploaded through a feed sourced from another store. To accomplish this, I developed custom PHP scripts from scratch to handle various feed actions. These scripts efficiently open the CSV feed, create categories, brands, and products, as well as upload and update product data, including prices. Notably, the prices of the products are adjusted with a higher percentage compared to the values received from the feed. During the latest update, this store successfully managed over 4000 products. Customers can conveniently make payments using their cards through the MobilPay module. To create the contact form, I edited TPL, HTML, and CSS, and integrated an iframe with a WordPress page utilizing the Contact Form 7 module. Web Development Projects Website: www.lavmag.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Modules: Cron Jobs, MobilPay, Facebook Pixel Products Feed Project Collaboration: Individual Web Project Status: Done Media Platforms: Xara Photo & Graphic Designer, Paint.net online shop web content web design web maintenance Worked at: Pia Soft Product Date: 07.2020 - 09.2020 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/lavmag\/web\/home\/home.webp"
    },
    {
        "page": "project-logistic-brain.html",
        "meta-title": "Logistic Brain",
        "meta-description": "This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. This website was a significant challenge, given its futuristic design and the necessity for many elements to function in a specific manner. To achieve this, numerous functionalities were implemented using plugins, Elementor loops, custom codes, and custom CSS scripts. On the landing page, a slider is integrated with custom CSS and remote buttons, each linked to a specific slide within the slider.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Logistic Brain This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. This website was a significant challenge, given its futuristic design and the necessity for many elements to function in a specific manner. To achieve this, numerous functionalities were implemented using plugins, Elementor loops, custom codes, and custom CSS scripts. On the landing page, a slider is integrated with custom CSS and remote buttons, each linked to a specific slide within the slider. Web Development Projects Website: logistic-brain.co.il Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP, jQuery Modules: Elementor Website Builder Pro, Unlimited Elements for Elementor Premium, Dynamic Conditions, Advanced Custom Fields Project Collaboration: Individual, Teamwork Web Project Status: Done presentation website web content web design Worked at: Mentor Marketing Experts Date: 02.2024 - 03.2024 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/logistic-brain\/web\/home\/home.webp"
    },
    {
        "page": "project-marasafety.html",
        "meta-title": "Mara Safety",
        "meta-description": "This is one of the first websites I have created in my career. When I started working on it, the website was already 30% complete. Mara Safety proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for the business.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Mara Safety This is one of the first websites I have created in my career. When I started working on it, the website was already 30% complete. Mara Safety proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for the business. Web Development Projects Website: www.echipamentedeprotectie.eu Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Project Collaboration: Individual, Teamwork Web Project Status: Done online shop web content Worked at: Pia Soft Product Date: 10.2019 - 12.2019 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/marasafety\/web\/home\/home.webp"
    },
    {
        "page": "project-masiniinratebaiamare.html",
        "meta-title": "Masini in Rate Baia Mare",
        "meta-description": "Masini in Rate Baia Mare proudly presents a minimalistic online shop created with WordPress, offering a clean and captivating showcase for the business. The products cannot be bought directly, but on the product page there is a button to send a message to the seller. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Masini in Rate Baia Mare Masini in Rate Baia Mare proudly presents a minimalistic online shop created with WordPress, offering a clean and captivating showcase for the business. The products cannot be bought directly, but on the product page there is a button to send a message to the seller. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: www.masiniinratebaiamare.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: WP Bakery, Contact Form 7, Woocommerce, Slider Revolution Project Collaboration: Individual Web Project Status: Done presentation website web content web design Worked at: Pia Soft Product Date: 06.2020 - 07.2020 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/masiniinratebaiamare\/web\/home\/home-1.webp"
    },
    {
        "page": "project-medicalortovit.html",
        "meta-title": "Medical Ortovit - Products",
        "meta-description": "When I started working on it, the website was already 60% complete. Website make in WordPress for blog and the sale of medical products and services. The work I made in this project, was the products section (www.ortovit.eu\/produse\/), I have created over 200 pages, all connected to each other with a friendly interface and an image suggestive of the section.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Medical Ortovit - Products When I started working on it, the website was already 60% complete. Website make in WordPress for blog and the sale of medical products and services. The work I made in this project, was the products section (www.ortovit.eu\/produse\/), I have created over 200 pages, all connected to each other with a friendly interface and an image suggestive of the section. Web Development Projects Website: www.ortovit.eu\/produse\/ Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP, jQuery Modules: WP Bakery Project Collaboration: Individual Web Project Status: Done web content web design Worked at: Pia Soft Product Date: 07.2021 - 09.2021 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/medicalortovit\/web\/home\/home.webp"
    },
    {
        "page": "project-merkaz-nadlan.html",
        "meta-title": "Merkaz Ha-Ir - City Center",
        "meta-description": "This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. The landing page features a dynamic slider presentation designed for large screens, reminiscent of PowerPoint. Custom navigation buttons and jQuery enhancements ensure smooth transitions between slides. Plus, seamlessly scroll through the content using your mouse. This website was a significant challenge, given its futuristic design and the necessity for many elements to function in a specific manner. To achieve this, numerous functionalities were implemented using plugins, Elementor loops, custom codes, and a plethora of custom CSS scripts.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Merkaz Ha-Ir - City Center This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. The landing page features a dynamic slider presentation designed for large screens, reminiscent of PowerPoint. Custom navigation buttons and jQuery enhancements ensure smooth transitions between slides. Plus, seamlessly scroll through the content using your mouse. This website was a significant challenge, given its futuristic design and the necessity for many elements to function in a specific manner. To achieve this, numerous functionalities were implemented using plugins, Elementor loops, custom codes, and a plethora of custom CSS scripts. Web Development Projects Website: merkaz-nadlan.co.il Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP, jQuery Modules: Elementor Website Builder Pro, Unlimited Elements for Elementor Premium, Dynamic Conditions, Dynamic Elementor, Advanced Custom Fields Project Collaboration: Individual, Teamwork Web Project Status: Done presentation website web content web design Worked at: Mentor Marketing Experts Date: 02.2024 - 03.2024 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/merkaz-nadlan\/web\/home\/home.webp"
    },
    {
        "page": "project-mewi.html",
        "meta-title": "Mewi",
        "meta-description": "At this Wordpress site, I had to do maintenance, troubleshooting, code changes, plugin updates, and creating HTML & CSS content for the site's Newsletter. Also I made some redesign for few pages with Elementor plugin and changed the theme CSS at some elements. I worked on optimization, where I resize the images from the first page at 2500px with Topaz Gigapixel AI and I have changed on website with a compressed versions.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development I added a search bar to the menu with the Advanced Search and Mega Menu modules. The results of the search are showing live with ajax through the Advanced Search module, which has been modified in its files so that it doesn`t display the type of the item found and some elements were translated in Romanian. In the section below are HTML and CSS newsletter templates. These were made by receiving images, a DOCX document with the text and links it should contain. Images were uploaded to the site host via FileZilla and cPanel to work globally. Mewi At this Wordpress site, I had to do maintenance, troubleshooting, code changes, plugin updates, and creating HTML & CSS content for the site's Newsletter. Also I made some redesign for few pages with Elementor plugin and changed the theme CSS at some elements. I worked on optimization, where I resize the images from the first page at 2500px with Topaz Gigapixel AI and I have changed on website with a compressed versions. Web Development Projects Website: www.mewi.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, WP Bakery Project Collaboration: Individual Web Project Status: Undone web content web design web maintenance Worked at: Netex Romania Date: 01.2022 - 03.2023 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/mewi\/web\/home\/home.webp"
    },
    {
        "page": "project-mobilasimexplus.html",
        "meta-title": "Mobila Simex Plus",
        "meta-description": "Mobila Simex Plus proudly presents a minimalistic online shop created with Prestashop 1.7, offering a clean and captivating showcase for the business. The products can be bought in sets or separately. Payment for purchases can be made only by cash on delivery, and confirmation of delivery is made by the merchant.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 2 photos that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo Mobila Simex Plus Mobila Simex Plus proudly presents a minimalistic online shop created with Prestashop 1.7, offering a clean and captivating showcase for the business. The products can be bought in sets or separately. Payment for purchases can be made only by cash on delivery, and confirmation of delivery is made by the merchant. Web Development Projects Visual Media Projects Website: www.mobilasimexplus.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Project Collaboration: Individual Web Project Status: Done Facebook: www.facebook.com\/producator.mobila.lemn.masiv Media Platforms: Xara Photo & Graphic Designer, Paint.net online shop web content Worked at: Pia Soft Product Date: 11.2019 - 02.2020 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/mobilasimexplus\/web\/home\/home.webp"
    },
    {
        "page": "project-mycreativedesign.html",
        "meta-title": "My Creative Design",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media My Creative Design Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Facebook: www.facebook.com\/mycreativedesignbymuresanbrod Media Platforms: Xara Photo & Graphic Designer, Paint.net media image Worked at: Pia Soft Product Date: 12.2019 - 12.2019 photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/mycreativedesign\/media\/banners\/media-4.webp"
    },
    {
        "page": "project-netexromania.html",
        "meta-title": "Netex Romania",
        "meta-description": "At this site, I had to do maintenance, fixing back-end bugs, PHP files from theme files, troubleshooting, code changes, plugin updates, and banners. Here was my second job, working at this company and even at it's website. I was hired on 2021 December, and most of my part was to work at few websites, maintenance most of the time, and most important project was the redesing of the ReifenDirekt websites.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Visual Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 1 photo that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo Netex Romania At this site, I had to do maintenance, fixing back-end bugs, PHP files from theme files, troubleshooting, code changes, plugin updates, and banners. Here was my second job, working at this company and even at it's website. I was hired on 2021 December, and most of my part was to work at few websites, maintenance most of the time, and most important project was the redesing of the ReifenDirekt websites. Web Development Projects Visual Media Projects Website: www.netex.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Project Collaboration: Individual, Teamwork Facebook: www.facebook.com\/netex.ro Media Platforms: Photopea web maintenance Worked at: Netex Romania Date: 12.2021 - 04.2023 web photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/netexromania\/web\/home\/home.webp"
    },
    {
        "page": "project-petri.html",
        "meta-title": "Petri",
        "meta-description": "At this project I worked in a team to create a custom theme in Wordpress. My part at this project was to translate content from the Figma project to website elements. I have created blocks, pages with PHP, SCSS, and JSON using:  PhpStorm, GitHub, Prepros, XAMPP. During this project, it was my first time coding PHP using taxonomies, terms, and custom posts within the WordPress environment",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Petri At this project I worked in a team to create a custom theme in Wordpress. My part at this project was to translate content from the Figma project to website elements. I have created blocks, pages with PHP, SCSS, and JSON using: PhpStorm, GitHub, Prepros, XAMPP. During this project, it was my first time coding PHP using taxonomies, terms, and custom posts within the WordPress environment Web Development Projects Website: www.petri.com Platform: Wordpress Languages: HTML, CSS, SASS, JS, SQL, PHP Modules: Gutenberg Website Builder Project Collaboration: Teamwork Web Project Status: Undone presentation website web design Worked at: Enlivy Date: 05.2023 - 06.2023 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/petri\/web\/home\/home.webp"
    },
    {
        "page": "project-philadelphiarugcleaning.html",
        "meta-title": "Philadelphia Rug Cleaning",
        "meta-description": "This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Philadelphia Rug Cleaning This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. Web Development Projects Website: philadelphiarugcleaning.com Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP, jQuery Modules: Elementor Website Builder Pro, Unlimited Elements for Elementor Premium, Dynamic Conditions, Advanced Custom Fields Project Collaboration: Individual, Teamwork Web Project Status: Done presentation website web content web design Worked at: Mentor Marketing Experts Date: 02.2024 - 02.2024 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/philadelphiarugcleaning\/web\/home\/home.webp"
    },
    {
        "page": "project-piasoftproduct.html",
        "meta-title": "Pia Soft Product",
        "meta-description": "This is a company's presentation site, and is made in Wordpress with modules such as Elementor and Contact Form 7. Also the redesign logo was made by me to. The photo elements was edited in Photopea. At this website I didn't make all the pages, and all the SEO optimization. Here I work with colleague on this websites and on many more. I was hired first time at this small company in 2019 October, we were 2 workers at the beginning only, but the only part where we work together was just on SEO optimization and on the error checking at websites. After approximate 1 year and half from the point I worked there, only me remained as an employeree. In total I worked 3 years and 1 month at this company over 30 websites in Wordpress and Prestashop, and over 2000 foto-video media for promotions.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Visual Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 19 photos and 1 video that showcase my expertise in delivering impactful visuals for social media promotion. From stunning imagery to engaging videos, each piece is meticulously created to elevate your brand's online presence. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo video 0:00 \/ 1x Pia Soft Product This is a company's presentation site, and is made in Wordpress with modules such as Elementor and Contact Form 7. Also the redesign logo was made by me to. The photo elements was edited in Photopea. At this website I didn't make all the pages, and all the SEO optimization. Here I work with colleague on this websites and on many more. I was hired first time at this small company in 2019 October, we were 2 workers at the beginning only, but the only part where we work together was just on SEO optimization and on the error checking at websites. After approximate 1 year and half from the point I worked there, only me remained as an employeree. In total I worked 3 years and 1 month at this company over 30 websites in Wordpress and Prestashop, and over 2000 foto-video media for promotions. Web Development Projects Visual Media Projects Website: www.piasoftproduct.com Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Individual, Teamwork Web Project Status: Done Facebook: www.facebook.com\/piasoftproduct Instagram: www.instagram.com\/piasoftproduct\/ YouTube: www.youtube.com\/channel\/UCtTxge0ZhOW3jVxsXzBaJJg Media Platforms: Photopea, Xara Photo & Graphic Designer, Paint.net, Sony Vegas, After Effects presentation website web content web design web maintenance seo optimization media image media video Worked at: Pia Soft Product Date: 10.2019 - 11.2022 web media-web photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/piasoftproduct\/web\/home\/home.webp"
    },
    {
        "page": "project-prismanord.html",
        "meta-title": "Prisma Nord",
        "meta-description": "The online shop with over 150 products is built on Prestashop 1.7. To add products to the cart, a price and a quantity with a non-zero value must be provided. However, there are two buttons available for alternative contact options: one for phone contact and another for submitting a form. The form was customized using TPL, HTML, CSS, and JS, with integration of the Contact Form 7 module. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. The content from 'Visual Media Projects' section was made in 03.2020. The content from 'Web Development Projects' section was made in 10.2023 - 02.2024.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Visual Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 2 photos that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo Prisma Nord The online shop with over 150 products is built on Prestashop 1.7. To add products to the cart, a price and a quantity with a non-zero value must be provided. However, there are two buttons available for alternative contact options: one for phone contact and another for submitting a form. The form was customized using TPL, HTML, CSS, and JS, with integration of the Contact Form 7 module. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. The content from 'Visual Media Projects' section was made in 03.2020. The content from 'Web Development Projects' section was made in 10.2023 - 02.2024. Web Development Projects Visual Media Projects Miscellaneous Projects Website: acoperisul-prisma.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Modules: Creative Elements - Elementor Website Builder, ETS Contact Form 7, Pretty URLs Project Collaboration: Individual Web Project Status: Done Facebook: www.facebook.com\/profile.php?id=100054479439548 Banner: www.facebook.com\/photo\/?fbid=103072591371526&set=a.561943758964934 Media Platforms: Xara Photo & Graphic Designer, Paint.net online shop web content web design media image Worked as: Freelancer Date: 03.2020 - 02.2024 web media-web photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/prismanord\/web\/home\/home.webp"
    },
    {
        "page": "project-promotiimars.html",
        "meta-title": "Promotii Mars",
        "meta-description": "Website make in WordPress for contests and promotions. Most of the contests are created in a custom PHP form. The design of the form and its functionalities are created based on PSD images with the contest. Few pages from menu have JS and CSS animation for user interaction with items. Main plugins used for creating the forms for competitions in this website are Elementor and PHP Everywhere. Over 20 of different forms I had created here with different design and in some cases with different functions.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Promotii Mars Website make in WordPress for contests and promotions. Most of the contests are created in a custom PHP form. The design of the form and its functionalities are created based on PSD images with the contest. Few pages from menu have JS and CSS animation for user interaction with items. Main plugins used for creating the forms for competitions in this website are Elementor and PHP Everywhere. Over 20 of different forms I had created here with different design and in some cases with different functions. Web Development Projects Website: www.promotiimars.ro Platform: Wordpress Languages: HTML, CSS, JS, jQuery, SQL, PHP Modules: Elementor Website Builder Project Collaboration: Individual, Teamwork Web Project Status: Done presentation website contest application web content web design web maintenance Worked at: Pia Soft Product Date: 03.2020 - 11.2022 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/promotiimars\/web\/home\/home.webp"
    },
    {
        "page": "project-promotionalcampaignstndc.html",
        "meta-title": "Promotional campaigns - Tndc",
        "meta-description": "In collaboration with TNDC, I developed two website pages, each dedicated to a promotional campaign for Snickers and Orbit (promotiiorbit.ro and promotiiorbit.ro\/choco). These pages feature custom PHP form scripts enabling users to register in a database by submitting participant data and an image of the product invoice. The PHP form is time-restricted, allowing customers to participate only during the promotion period. After the promotion concludes, the form is automatically disabled, and I manually update the pages with the winners. For design, I utilized Elementor as the page builder, complemented by custom CSS, HTML, and JS codes to enhance the overall user experience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Promotional campaigns - Tndc In collaboration with TNDC, I developed two website pages, each dedicated to a promotional campaign for Snickers and Orbit (promotiiorbit.ro and promotiiorbit.ro\/choco). These pages feature custom PHP form scripts enabling users to register in a database by submitting participant data and an image of the product invoice. The PHP form is time-restricted, allowing customers to participate only during the promotion period. After the promotion concludes, the form is automatically disabled, and I manually update the pages with the winners. For design, I utilized Elementor as the page builder, complemented by custom CSS, HTML, and JS codes to enhance the overall user experience. Web Development Projects Miscellaneous Projects Website: promotiiorbit.ro Platform: Wordpress Languages: HTML, CSS, JS, jQuery, SQL, PHP Modules: Elementor Website Builder, PHP Everywhere Project Collaboration: Individual Web Project Status: Done contest application web content Worked as: Freelancer Date: 08.2023 - 09.2023 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/promotionalcampaignstndc\/web\/home\/home.webp"
    },
    {
        "page": "project-purstyle.html",
        "meta-title": "Pur Style",
        "meta-description": "At this project I had to make some page reworks, fixing errors adding new features like booking and contact form. The new pages I had made with these plugins: Elementor, Contact Form 7 and Booked. Also the content that I have created and changed was made for 2 languages: English and German.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Pur Style At this project I had to make some page reworks, fixing errors adding new features like booking and contact form. The new pages I had made with these plugins: Elementor, Contact Form 7 and Booked. Also the content that I have created and changed was made for 2 languages: English and German. Web Development Projects Website: www.purstyle.net Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP, jQuery Modules: Elementor Website Builder, Contact Form 7, Booked Project Collaboration: Individual web content web maintenance Worked at: Netex Romania Date: 11.2022 - 03.2023 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/purstyle\/web\/home\/home.webp"
    },
    {
        "page": "project-reifendirekt.html",
        "meta-title": "Reifen Direkt",
        "meta-description": "For this project, I had to make HTML static pages. I got previews for a redesign of pages in zeplin format and with them, I make the pages in HTML format. Here I use Node.js, SCSS, JavaScript, jQuery, Bootstrap 5. Also, some pages required the interaction and functionalities that were implemented with jQuery. I had meets with back-end team, where we were discussing the necessary changes to the temples that I had to make at few cases.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development 0:00 \/ 1x 0:00 \/ 1x Reifen Direkt For this project, I had to make HTML static pages. I got previews for a redesign of pages in zeplin format and with them, I make the pages in HTML format. Here I use Node.js, SCSS, JavaScript, jQuery, Bootstrap 5. Also, some pages required the interaction and functionalities that were implemented with jQuery. I had meets with back-end team, where we were discussing the necessary changes to the temples that I had to make at few cases. Web Development Projects Website: www.reifendirekt.de Platform: NodeJS Languages: HTML, CSS, SASS, JS, Bootstrap, jQuery Project Collaboration: Individual Web Project Status: Done web content web design Worked at: Netex Romania Date: 12.2021 - 07.2022 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/reifendirekt\/web\/home\/home.webp"
    },
    {
        "page": "project-remodelingmv.html",
        "meta-title": "Modern Vision Remodeling",
        "meta-description": "This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Modern Vision Remodeling This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. Web Development Projects Website: remodelingmv.com Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP, jQuery Modules: Elementor Website Builder Pro, Unlimited Elements for Elementor Premium, Dynamic Conditions, Advanced Custom Fields Project Collaboration: Individual, Teamwork Web Project Status: Done presentation website web content web design Worked at: Mentor Marketing Experts Date: 02.2024 - 02.2024 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/remodelingmv\/web\/home\/home.webp"
    },
    {
        "page": "project-resurseeducationale.html",
        "meta-title": "Resurse Educationale",
        "meta-description": "Website for school projects, contests, courses and shop was made in WordPress. It have a custom PHP code integrated with 2 modules that which allows uploading files depending on the number of uploads or depending on the subscription. The files accepted by the administrator will be displayed on the site. The number of uploads and subscriptions can be purchased with payment by card. Payment can be made with the card through the EuPlatesc module..",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Resurse Educationale Website for school projects, contests, courses and shop was made in WordPress. It have a custom PHP code integrated with 2 modules that which allows uploading files depending on the number of uploads or depending on the subscription. The files accepted by the administrator will be displayed on the site. The number of uploads and subscriptions can be purchased with payment by card. Payment can be made with the card through the EuPlatesc module.. Web Development Projects Website: www.resurseprofesori.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP, jQuery Modules: Elementor Website Builder, Contact Form 7, WooCommerce, PHP Everywhere, WooCommerce Points and Rewards, WooCommerce Memberships, EuPlatesc Pay Module Project Collaboration: Individual Web Project Status: Done presentation website web content web design web maintenance Worked at: Pia Soft Product Date: 09.2020 - 11.2020 web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/resurseeducationale\/web\/home\/home.webp"
    },
    {
        "page": "project-revelnail-avadores.html",
        "meta-title": "Revel Nail - Avadores",
        "meta-description": "The online shop for powders, liquids and other nail accessories is made in Prestashop 1.6. On this website, the products are supplied by Revel Nail and sold by Avadores under the name Revel Nail Romania on the Romanian market. It has a shortcut module that has been modified by TPL to display a Facebook login button. Payment can be made with the card through the MobilPay module, which has also been modified by TPL and PHP to deactivate the payment method of this module for some products.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Visual Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 134 photos and 5 videos that showcase my expertise in delivering impactful visuals for social media promotion. From stunning imagery to engaging videos, each piece is meticulously created to elevate your brand's online presence. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo video 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x Revel Nail - Avadores The online shop for powders, liquids and other nail accessories is made in Prestashop 1.6. On this website, the products are supplied by Revel Nail and sold by Avadores under the name Revel Nail Romania on the Romanian market. It has a shortcut module that has been modified by TPL to display a Facebook login button. Payment can be made with the card through the MobilPay module, which has also been modified by TPL and PHP to deactivate the payment method of this module for some products. Web Development Projects Visual Media Projects Website: www.revelnail.ro Platform: Prestashop Languages: HTML, CSS, JS, SQL, PHP, TPL Modules: Creative Elements - Elementor Website Builder, ETS Contact Form 7, Pretty URLs, Facebook Pixel Products Feed, Google Merchant Center Feed Project Collaboration: Individual Web Project Status: Done Facebook: www.facebook.com\/revelromania Instagram: www.instagram.com\/revelnailromania1\/ Media Platforms: Photopea, Xara Photo & Graphic Designer, Paint.net, Sony Vegas, After Effects online shop web content web design media image media video web maintenance seo optimization Worked at: Pia Soft Product Date: 11.2019 - 11.2022 web media-web content-web photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/revelnail-avadores\/web\/home\/home.webp"
    },
    {
        "page": "project-revistaeducatie.html",
        "meta-title": "Centrul de Excelenta",
        "meta-description": "Centrul de Excelenta proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The purpose of this application is for users to be able to send pdf documents (magazines and books) to be uploaded to the site in the respective section, or they can choose to sign up for projects (such as contests) dedicated to teachers with different dates, including pdf files. The files that are sent to the site are saved in the hosting. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Centrul de Excelenta Centrul de Excelenta proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The purpose of this application is for users to be able to send pdf documents (magazines and books) to be uploaded to the site in the respective section, or they can choose to sign up for projects (such as contests) dedicated to teachers with different dates, including pdf files. The files that are sent to the site are saved in the hosting. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Web Development Projects Website: www.revistaeducatie.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Individual Web Project Status: Done presentation website web content web design web maintenance Worked at: Pia Soft Product Date: 11.2019 - 11.2022 web media-web content-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/revistaeducatie\/web\/home\/home.webp"
    },
    {
        "page": "project-roundselfie.html",
        "meta-title": "Round Selfie",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media Round Selfie Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Miscellaneous Projects Project Collaboration: Individual Facebook: www.facebook.com\/RoundSelfie Media Platforms: Photopea media image Worked as: Freelancer Date: 12.2022 - 12.2022 photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/roundselfie\/media\/logo\/facebook-logo.webp"
    },
    {
        "page": "project-royalcompass.html",
        "meta-title": "Royal Compass",
        "meta-description": "At this project I had to make a website for a company that promote sports in nature. This website was not completely finished in terms of the aspects of texts and images on the pages.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Royal Compass At this project I had to make a website for a company that promote sports in nature. This website was not completely finished in terms of the aspects of texts and images on the pages. Web Development Projects Website: beta.royalcompass.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder Project Collaboration: Individual Web Project Status: Undone presentation website web content web design Worked at: Netex Romania Date: 11.2022 - 04.2023 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/royalcompass\/web\/home\/home.webp"
    },
    {
        "page": "project-spalatorieautomatabaiamare.html",
        "meta-title": "Spalatorie Automata Baia Mare",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media Spalatorie Automata Baia Mare Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Facebook: www.facebook.com\/SpalatorieHaineBaiaMareAutomata Media Platforms: Photopea media image Worked at: Pia Soft Product Date: 06.2022 - 08.2022 photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/spalatorieautomatabaiamare\/media\/banners\/banner-1-1-01.webp"
    },
    {
        "page": "project-specialevents.html",
        "meta-title": "Special Events",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media Special Events Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Miscellaneous Projects Project Collaboration: Individual Media Platforms: Photopea, Xara Photo & Graphic Designer, Paint.net media image Worked at: Unspecified Date: 06.2021 - 11.2022 photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/specialevents\/media\/invitations\/weeding-inv-01.webp"
    },
    {
        "page": "project-speed-sm.html",
        "meta-title": "Speed - Satu Mare",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media Speed - Satu Mare Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Facebook: www.facebook.com\/livrariladomiciliuSatuMare Media Platforms: Xara Photo & Graphic Designer, Paint.net media image Worked at: Pia Soft Product Date: 01.2020 - 03.2020 photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/speed-sm\/media\/banners-old-01\/banner-old-02.webp"
    },
    {
        "page": "project-strikerproduction.html",
        "meta-title": "Striker Production",
        "meta-description": "Main activity of the Striker Production is the video editing at different video games and real life footage. In addition to creating my own video-photo content, I organize video editing contests with sponsors and I collaborate with clients on various projects. Simple portfolio website is made with Google Site. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Visual Media Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection of 137 photos and 5 videos that showcase my expertise in delivering impactful visuals for social media promotion. From stunning imagery to engaging videos, each piece is meticulously created to elevate your brand's online presence. Explore the power of my unique visual creations and unlock the potential to captivate your audience. photo video 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x Striker Production Main activity of the Striker Production is the video editing at different video games and real life footage. In addition to creating my own video-photo content, I organize video editing contests with sponsors and I collaborate with clients on various projects. Simple portfolio website is made with Google Site. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Web Development Projects Visual Media Projects Miscellaneous Projects Website: sites.google.com\/view\/strikerproduction\/ Platform: Google Site Project Collaboration: Individual Web Project Status: Done Facebook: www.facebook.com\/strikerproduction Instagram: www.instagram.com\/strikerprod09\/ YouTube: www.youtube.com\/c\/striker09\/ Google Form: forms.gle\/XzfTBkvepUoUte2b9 Discord: discord.gg\/b9YQecx Google Site: sites.google.com\/view\/strikerproduction\/ Steam: steamcommunity.com\/groups\/strikelounge Media Platforms: Photopea, Xara Photo & Graphic Designer, Paint.net, Sony Vegas, Blender, After Effects presentation website web content web design media image media video personal Date: 09.2016 - 12.2022 web content-web photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/strikerproduction\/web\/home\/home.webp"
    },
    {
        "page": "project-superbrain.html",
        "meta-title": "Super Brain",
        "meta-description": "Website made in WordPress for company presentation and contact. The website was made in few days, 3-5 days. At this project I worked with Elementor plugin for editing the theme pages and for creating new elements, also the theme on which was created this website, was changed more then 50%. All the images was rezise with Topaz Gigapixel and edited with Photopea.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Web Media Content Super Brain Website made in WordPress for company presentation and contact. The website was made in few days, 3-5 days. At this project I worked with Elementor plugin for editing the theme pages and for creating new elements, also the theme on which was created this website, was changed more then 50%. All the images was rezise with Topaz Gigapixel and edited with Photopea. Web Development Projects Website: www.superbrain.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7, Slider Revolution Project Collaboration: Individual Web Project Status: Done presentation website web content web design Worked at: Pia Soft Product Date: 11.2022 - 11.2022 web media-web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/superbrain\/web\/home\/home.webp"
    },
    {
        "page": "project-tinib.html",
        "meta-title": "Tinib",
        "meta-description": "Website make in WordPress for services like thermal power plants, pumps, air conditioning, ventilation systems. At this website I had to create manually over 200 products with specific HTML description.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Tinib Website make in WordPress for services like thermal power plants, pumps, air conditioning, ventilation systems. At this website I had to create manually over 200 products with specific HTML description. Web Development Projects Website: www.tinib.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: WP Bakery, Woocommerce, Contact Form 7 Project Collaboration: Individual Web Project Status: Done online shop web content Worked at: Pia Soft Product Date: 05.2021 - 07.2021 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/tinib\/web\/home\/home.webp"
    },
    {
        "page": "project-transportosian.html",
        "meta-title": "Transport Osian",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media 0:00 \/ 1x 0:00 \/ 1x Transport Osian Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Facebook: www.facebook.com\/transportosian Media Platforms: Photopea, Sony Vegas media image Worked at: Pia Soft Product Date: 06.2021 - 07.2021 photo video Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/transportosian\/media\/banners-old\/banner-old.webp"
    },
    {
        "page": "project-vreaualpin.html",
        "meta-title": "Vreau Alpin",
        "meta-description": "I made several significant changes to this site as web design enhancements, content editor, and the addition of new functionalities. These updates included creating a redirect from the secondary site alpin57lux.com to the online store, implementing filters for approximately 100 products, modifying the CSS\/HTML of the theme to improve element display, and resolving various errors on the site, such as fixing the popup-close functionality. Additionally, I added an employerment form, implemented a zoom-in feature for the product slider, and addressed numerous other improvements and fixes.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Vreau Alpin I made several significant changes to this site as web design enhancements, content editor, and the addition of new functionalities. These updates included creating a redirect from the secondary site alpin57lux.com to the online store, implementing filters for approximately 100 products, modifying the CSS\/HTML of the theme to improve element display, and resolving various errors on the site, such as fixing the popup-close functionality. Additionally, I added an employerment form, implemented a zoom-in feature for the product slider, and addressed numerous other improvements and fixes. Web Development Projects Miscellaneous Projects Website: www.vreaualpin.ro Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Individual Web Project Status: Done web content web maintenance Worked as: Freelancer Date: 05.2023 - 07.2023 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/vreaualpin\/web\/home\/home.webp"
    },
    {
        "page": "project-vseconstruct.html",
        "meta-title": "VSE Construct",
        "meta-description": "Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media VSE Construct Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Visual Media Projects Project Collaboration: Individual Facebook: www.facebook.com\/VSEConstruct Media Platforms: Photopea media image Worked at: Pia Soft Product Date: 04.2022 - 11.2022 photo Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/vseconstruct\/media\/banners-1-1\/banner-1-1-01.webp"
    },
    {
        "page": "project-woodworkart.html",
        "meta-title": "Wood Work Art",
        "meta-description": "Website make in WordPress for a company that provide authentic solid wood furniture, in modern or vintage style, hand carved or with CNC, of a high quality that guaranteed to offer you in any space an elegance, refinement and unique character. The site is made in 3 languages.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Wood Work Art Website make in WordPress for a company that provide authentic solid wood furniture, in modern or vintage style, hand carved or with CNC, of a high quality that guaranteed to offer you in any space an elegance, refinement and unique character. The site is made in 3 languages. Web Development Projects Website: www.woodworkart.eu Platform: Wordpress Languages: HTML, CSS, JS, SQL, PHP Modules: Elementor Website Builder, Contact Form 7 Project Collaboration: Individual Web Project Status: Done presentation website web content web design seo optimization Worked at: Pia Soft Product Date: 11.2019 - 12.2019 web Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/woodworkart\/web\/home\/home.webp"
    },
    {
        "page": "projects.html",
        "meta-title": "Catalog",
        "meta-description": "Showcase of projects I have created or I was involved, featuring designs and functionality of media content and websites.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Projects category date employee web-platform web-language media-platform Search Web Development Projects Modern Vision Remodeling This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Philadelphia Rug Cleaning This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Logistic Brain This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Merkaz Ha-Ir - City Center This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Miscellaneous Projects Cekan - Case Study Translated Figma web design for the Case Study section on the cekan.ca website, ensuring 99% accuracy in replicating the responsiv Web Development Projects Miscellaneous Projects Promotional campaigns - Tndc In collaboration with TNDC, I developed two website pages, each dedicated to a promotional campaign for Snickers and Orbit (promot Web Development Projects Petri At this project I worked in a team to create a custom theme in Wordpress. My part at this project was to translate content from th Web Development Projects Miscellaneous Projects Vreau Alpin I made several significant changes to this site as web design enhancements, content editor, and the addition of new functionalitie Visual Media Projects Miscellaneous Projects Augustin Nail Trainer Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Miscellaneous Projects Round Selfie Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Web Development Projects Pur Style At this project I had to make some page reworks, fixing errors adding new features like booking and contact form. The new pages I Web Development Projects Royal Compass At this project I had to make a website for a company that promote sports in nature. This website was not completely finished in t Web Development Projects Super Brain Website made in WordPress for company presentation and contact. The website was made in few days, 3-5 days. At this project I work Visual Media Projects Spalatorie Automata Baia Mare Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects VSE Construct Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Web Development Projects Ilnic Electric Ilnic Electric proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the b Web Development Projects Mewi At this Wordpress site, I had to do maintenance, troubleshooting, code changes, plugin updates, and creating HTML & CSS content fo Web Development Projects Visual Media Projects Netex Romania At this site, I had to do maintenance, fixing back-end bugs, PHP files from theme files, troubleshooting, code changes, plugin upd Web Development Projects Reifen Direkt For this project, I had to make HTML static pages. I got previews for a redesign of pages in zeplin format and with them, I make t Web Development Projects AXA Company AXA Company proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the busi Visual Media Projects Gamada Metal Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Web Development Projects Medical Ortovit - Products When I started working on it, the website was already 60% complete. Website make in WordPress for blog and the sale of medical pro Web Development Projects Bonea Med This project involved creating a clinic website with appointment booking functionality. I used the Booked module in a WordPress we Web Development Projects Concordia CAR Concordia proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The websi Visual Media Projects Miscellaneous Projects Special Events Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Transport Osian Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Web Development Projects Acvatic Bebe Club A website has been created using WordPress to provide subscriptions for teaching babies and children how to swim. The site feature Web Development Projects Tinib Website make in WordPress for services like thermal power plants, pumps, air conditioning, ventilation systems. At this website I Web Development Projects Covoare Alex The online shop for different types and models of carpets, is made in Prestashop 1.7 with integrated payment method, via MobilPay. Web Development Projects Brisa Scents I have continued this project from a stage of 20% - 30% done, a WordPress website for perfume and spray sales. User-friendly inter Web Development Projects FreyMob Design The online shop for furniture is made in Prestashop 1.6. The site has 3 languages, and 2 currencies. The products on this applicat Web Development Projects Agromir Second-Hand The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Web Development Projects Resurse Educationale Website for school projects, contests, courses and shop was made in WordPress. It have a custom PHP code integrated with 2 modules Web Development Projects Visual Media Projects Agramix The online shop for tools, machine parts, agricultural and industrial equipment is made in Prestashop 1.7. The theme on which the Web Development Projects Visual Media Projects Casa Darius The online shop for furniture is made in Prestashop 1.7 with integrated payment method, via MobilPay. The products cannot be added Web Development Projects Lavmag The online shop for a wide range of products is built using Prestashop 1.7. All products are regularly updated and uploaded throug Web Development Projects Ambalaje Lavplast The online shop, built on Prestashop 1.7, offers a wide range of products. Customers can conveniently make payments using their ca Web Development Projects Masini in Rate Baia Mare Masini in Rate Baia Mare proudly presents a minimalistic online shop created with WordPress, offering a clean and captivating show Web Development Projects Ceramic & Stone Evolutione Evolutione proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for Web Development Projects Amorino The website, specializing in selling dresses for girls, is built using Prestashop 1.7. Customers have the option to make payments Web Development Projects Centrul de Resurse Educationale Centrul de Resurse Educationale proudly presents a minimalistic website created with WordPress, offering a clean and captivating s Web Development Projects Cafea Gano WordPress website created for an online shop specializing in natural supplements and coffee. The shop was made using the Woocommer Visual Media Projects Dabo - SM & BM Here is my media content for the promotion of Dabo Satu Mare & Dabo Baia Mare during the pandemic, which took place in 2020. Exper Visual Media Projects DS Auto Center Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Web Development Projects Visual Media Projects Miscellaneous Projects Prisma Nord The online shop with over 150 products is built on Prestashop 1.7. To add products to the cart, a price and a quantity with a non- Web Development Projects Promotii Mars Website make in WordPress for contests and promotions. Most of the contests are created in a custom PHP form. The design of the fo Web Development Projects Visual Media Projects Agromir The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Visual Media Projects HART - Keep your hat on Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Bus-Vip Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Web Development Projects Casa Darius Casa Darius proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The web Visual Media Projects Speed - Satu Mare Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects My Creative Design Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Web Development Projects BRB Home This was one of the first websites I created using WordPress. The purpose of the project was to develop a presentation website aim Web Development Projects Copiatoare Alba Iulia Copiatoare Alba Iulia proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase fo Web Development Projects Visual Media Projects Mobila Simex Plus Mobila Simex Plus proudly presents a minimalistic online shop created with Prestashop 1.7, offering a clean and captivating showca Web Development Projects Visual Media Projects Revel Nail - Avadores The online shop for powders, liquids and other nail accessories is made in Prestashop 1.6. On this website, the products are suppl Web Development Projects Centrul de Excelenta Centrul de Excelenta proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for Web Development Projects Wood Work Art Website make in WordPress for a company that provide authentic solid wood furniture, in modern or vintage style, hand carved or wi Web Development Projects A&A Toys & Furniture This is one of the first websites I have created in my career. When I started working on it, the website was already 25% complete. Web Development Projects Mara Safety This is one of the first websites I have created in my career. When I started working on it, the website was already 30% complete. Web Development Projects Visual Media Projects Pia Soft Product This is a company's presentation site, and is made in Wordpress with modules such as Elementor and Contact Form 7. Also the redesi Web Development Projects Visual Media Projects Miscellaneous Projects Denis Marginas Simple portfolio website is made with Google Site. Experience the artistry behind my meticulously crafted media content for this c Web Development Projects Visual Media Projects Miscellaneous Projects Striker Production Main activity of the Striker Production is the video editing at different video games and real life footage. In addition to creati Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/remodelingmv\/logo\/logo.png"
    },
    {
        "page": "search.html",
        "meta-title": "Search",
        "meta-description": "Search items in the website.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Search Search About My name is Denis Ionut Marginas, I'm 25-year-old, and I've been working as a full-stack web developer and photo-video editor since 2019. Before entering the web development field, I worked as a freelance video editor, specializing in editing videos for video games. Blog Activity Dive into the world of a full-stack web developer and skilled photo-video editor. Explore the intersection of web development and visual storytelling on Denis Ionut Marginas's insightful blog Contact You can reach me by phone on WhatsApp or through my personal email address. Contact details are provided in the section below. Education Experience Discover my educational journey from high school to university, including courses and diplomas attained along the way. Employee Experience Explore my professional journey through my employ experience, where I showcase a chronological record of my employment history. Discover insights into my roles, responsibilities, and significant contributions at various companies, along with dates and key attributes. Experience Experience a captivating journey through my professional work from 2019 to 2023 in this short video. From a captivating intro to web development, photo editing, and video editing, witness my diverse expertise in just under two minutes. Portfolio My name is Denis Ionut Marginas, I'm 25-year-old, and I've been working as a full-stack web developer and photo-video editor since 2019. Before entering the web development field, I worked as a freelance video editor, specializing in editing videos for video games. Miscellaneous Projects Category: Miscellaneous Projects. Assortment of non-profit initiatives and personal passion projects, reflecting my diverse range of creative endeavors. A&A Toys & Furniture This is one of the first websites I have created in my career. When I started working on it, the website was already 25% complete. I took over from the previous developer and familiarized myself with the intricacies of WordPress and the Elementor Plugin environment along the way. Acvatic Bebe Club A website has been created using WordPress to provide subscriptions for teaching babies and children how to swim. The site features a blog with articles, and nearly all the content on the website is available in two languages: English and Romanian. My work on this project involved editing pages and translating content from Romanian to English using the translated text provided by the client. Agramix The online shop for tools, machine parts, agricultural and industrial equipment is made in Prestashop 1.7. The theme on which the site was built has been changed a lot in appearance through HTML, CSS, JS. For products that cannot be ordered, 2 buttons have been created: one to call for the product and another to send an email to request information about the product. The contact form was created by editing TPL, HTML, CSS, and an iframe with a WordPress page with the Contact Form 7 module. The products on the site were imported through a CSV file from the previous site (Wordpress). This site is permanently connected to the eMAG marketplace through a module, in other words it has a feed through API. Agromir Second-Hand The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to the cart, but there is 1 button to contact by phone for the product and 1 button to contact by email. The form was created by editing TPL, HTML, CSS and the Wordpress platform with the Contact Form 7 module and a JS script. The site has implemented modules from Prestashop Addons such as JoliSearch, Amazing gallery and other modules purchased or adapted free of charge for the site. Agromir The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to the cart, but there are 3 buttons to contact by phone for the product and 1 button to contact by email. The contact form was created by editing TPL, HTML, CSS, and an iframe with a WordPress page with the Contact Form 7 module. The site has implemented modules from Prestashop Addons such as JoliSearch, Amazing gallery and other modules purchased or adapted free of charge for the site. A button is displayed to contact via Whatsapp for products through a module that has been modified via JS to display various texts at a certain time. Amorino The website, specializing in selling dresses for girls, is built using Prestashop 1.7. Customers have the option to make payments using their cards through the PayU module. To create the contact form, I customized TPL, HTML, and CSS elements, and integrated an iframe with a WordPress page, utilizing the Contact Form 7 module. Augustin Nail Trainer Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. AXA Company AXA Company proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Bonea Med This project involved creating a clinic website with appointment booking functionality. I used the Booked module in a WordPress website. Clients can book appointments with specific doctors, and doctors can access, edit, and add appointments. BRB Home This was one of the first websites I created using WordPress. The purpose of the project was to develop a presentation website aimed at promoting furniture services and enabling customers to easily get in touch with the company. Brisa Scents I have continued this project from a stage of 20% - 30% done, a WordPress website for perfume and spray sales. User-friendly interface, diverse product collection. Secure transactions, detailed descriptions. Contact page for customer support. Bus-Vip Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Centrul de Resurse Educationale Centrul de Resurse Educationale proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The purpose of this application is for users to be able to send pdf documents (magazines and books) to be uploaded to the site in the respective section, or they can choose to sign up for projects (such as contests) dedicated to teachers with different dates, including pdf files. The files that are sent to the site are saved in the hosting. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Cafea Gano WordPress website created for an online shop specializing in natural supplements and coffee. The shop was made using the Woocommerce module. Concordia CAR Concordia proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Casa Darius Casa Darius proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Casa Darius The online shop for furniture is made in Prestashop 1.7 with integrated payment method, via MobilPay. The products cannot be added to the cart, but there are buttons to contact via phone for the specific store location. It have more than 30 new products with around 8-10 edited photos, products added in an empty room with pot decorations. Cekan - Case Study Translated Figma web design for the Case Study section on the cekan.ca website, ensuring 99% accuracy in replicating the responsive look across various screen sizes. Utilized HTML and SCSS to implement the page design, using Prepro to compile SCSS into CSS. Managed the code using PhpStorm. Completed the project in 4 days, dedicating 2-4 hours of work each day. Ceramic & Stone Evolutione Evolutione proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for the business. The customers can't buy the products, but with the intended buttons on the product page, they can contact the supplier via phone or with the product ask form. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Copiatoare Alba Iulia Copiatoare Alba Iulia proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Covoare Alex The online shop for different types and models of carpets, is made in Prestashop 1.7 with integrated payment method, via MobilPay. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Student Courses - Bachelor's thesis This is my Bachelor's thesis named 'Cursuri Studenti - Lucrare Licenta' where I aim was to develop a website catering specifically to students who require access to various courses or specific course materials in text format for reports or projects. The website primarily facilitates the uploading of course content in image format, which is then converted and stored in text format on the site. Additionally, users have the option to edit their personal data, customize their accounts with a logo, and, as administrators, manage both user accounts and course materials. Technologies used: Hypertext Markup Language (HTML), Zurb Foundation, JavaScript, Cascading Style Sheets (CSS), Hypertext Preprocessor (PHP), XAMPP, Tesseract OCR, HeidiSQL Dabo - SM & BM Here is my media content for the promotion of Dabo Satu Mare & Dabo Baia Mare during the pandemic, which took place in 2020. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Denis Marginas Simple portfolio website is made with Google Site. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. DS Auto Center Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. FreyMob Design The online shop for furniture is made in Prestashop 1.6. The site has 3 languages, and 2 currencies. The products on this application cannot be bought, but 2 buttons are provided on the product page: one to contact the distributor with a phone and the other to display the offer request form. Payment for purchases can be made only by cash on delivery, and confirmation of delivery is made by the merchant Gamada Metal Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. HART - Keep your hat on Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Ilnic Electric Ilnic Electric proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Ambalaje Lavplast The online shop, built on Prestashop 1.7, offers a wide range of products. Customers can conveniently make payments using their cards through the MobilPay module. To create the contact form, I edited TPL, HTML, and CSS, and integrated an iframe with a WordPress page utilizing the Contact Form 7 module. Lavmag The online shop for a wide range of products is built using Prestashop 1.7. All products are regularly updated and uploaded through a feed sourced from another store. To accomplish this, I developed custom PHP scripts from scratch to handle various feed actions. These scripts efficiently open the CSV feed, create categories, brands, and products, as well as upload and update product data, including prices. Notably, the prices of the products are adjusted with a higher percentage compared to the values received from the feed. During the latest update, this store successfully managed over 4000 products. Customers can conveniently make payments using their cards through the MobilPay module. To create the contact form, I edited TPL, HTML, and CSS, and integrated an iframe with a WordPress page utilizing the Contact Form 7 module. Logistic Brain This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. This website was a significant challenge, given its futuristic design and the necessity for many elements to function in a specific manner. To achieve this, numerous functionalities were implemented using plugins, Elementor loops, custom codes, and custom CSS scripts. On the landing page, a slider is integrated with custom CSS and remote buttons, each linked to a specific slide within the slider. Mara Safety This is one of the first websites I have created in my career. When I started working on it, the website was already 30% complete. Mara Safety proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for the business. Masini in Rate Baia Mare Masini in Rate Baia Mare proudly presents a minimalistic online shop created with WordPress, offering a clean and captivating showcase for the business. The products cannot be bought directly, but on the product page there is a button to send a message to the seller. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Medical Ortovit - Products When I started working on it, the website was already 60% complete. Website make in WordPress for blog and the sale of medical products and services. The work I made in this project, was the products section (www.ortovit.eu\/produse\/), I have created over 200 pages, all connected to each other with a friendly interface and an image suggestive of the section. Merkaz Ha-Ir - City Center This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. The landing page features a dynamic slider presentation designed for large screens, reminiscent of PowerPoint. Custom navigation buttons and jQuery enhancements ensure smooth transitions between slides. Plus, seamlessly scroll through the content using your mouse. This website was a significant challenge, given its futuristic design and the necessity for many elements to function in a specific manner. To achieve this, numerous functionalities were implemented using plugins, Elementor loops, custom codes, and a plethora of custom CSS scripts. Mewi At this Wordpress site, I had to do maintenance, troubleshooting, code changes, plugin updates, and creating HTML & CSS content for the site's Newsletter. Also I made some redesign for few pages with Elementor plugin and changed the theme CSS at some elements. I worked on optimization, where I resize the images from the first page at 2500px with Topaz Gigapixel AI and I have changed on website with a compressed versions. Mobila Simex Plus Mobila Simex Plus proudly presents a minimalistic online shop created with Prestashop 1.7, offering a clean and captivating showcase for the business. The products can be bought in sets or separately. Payment for purchases can be made only by cash on delivery, and confirmation of delivery is made by the merchant. My Creative Design Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Netex Romania At this site, I had to do maintenance, fixing back-end bugs, PHP files from theme files, troubleshooting, code changes, plugin updates, and banners. Here was my second job, working at this company and even at it's website. I was hired on 2021 December, and most of my part was to work at few websites, maintenance most of the time, and most important project was the redesing of the ReifenDirekt websites. Petri At this project I worked in a team to create a custom theme in Wordpress. My part at this project was to translate content from the Figma project to website elements. I have created blocks, pages with PHP, SCSS, and JSON using: PhpStorm, GitHub, Prepros, XAMPP. During this project, it was my first time coding PHP using taxonomies, terms, and custom posts within the WordPress environment Philadelphia Rug Cleaning This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. Pia Soft Product This is a company's presentation site, and is made in Wordpress with modules such as Elementor and Contact Form 7. Also the redesign logo was made by me to. The photo elements was edited in Photopea. At this website I didn't make all the pages, and all the SEO optimization. Here I work with colleague on this websites and on many more. I was hired first time at this small company in 2019 October, we were 2 workers at the beginning only, but the only part where we work together was just on SEO optimization and on the error checking at websites. After approximate 1 year and half from the point I worked there, only me remained as an employeree. In total I worked 3 years and 1 month at this company over 30 websites in Wordpress and Prestashop, and over 2000 foto-video media for promotions. Prisma Nord The online shop with over 150 products is built on Prestashop 1.7. To add products to the cart, a price and a quantity with a non-zero value must be provided. However, there are two buttons available for alternative contact options: one for phone contact and another for submitting a form. The form was customized using TPL, HTML, CSS, and JS, with integration of the Contact Form 7 module. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. The content from 'Visual Media Projects' section was made in 03.2020. The content from 'Web Development Projects' section was made in 10.2023 - 02.2024. Promotii Mars Website make in WordPress for contests and promotions. Most of the contests are created in a custom PHP form. The design of the form and its functionalities are created based on PSD images with the contest. Few pages from menu have JS and CSS animation for user interaction with items. Main plugins used for creating the forms for competitions in this website are Elementor and PHP Everywhere. Over 20 of different forms I had created here with different design and in some cases with different functions. Promotional campaigns - Tndc In collaboration with TNDC, I developed two website pages, each dedicated to a promotional campaign for Snickers and Orbit (promotiiorbit.ro and promotiiorbit.ro\/choco). These pages feature custom PHP form scripts enabling users to register in a database by submitting participant data and an image of the product invoice. The PHP form is time-restricted, allowing customers to participate only during the promotion period. After the promotion concludes, the form is automatically disabled, and I manually update the pages with the winners. For design, I utilized Elementor as the page builder, complemented by custom CSS, HTML, and JS codes to enhance the overall user experience. Pur Style At this project I had to make some page reworks, fixing errors adding new features like booking and contact form. The new pages I had made with these plugins: Elementor, Contact Form 7 and Booked. Also the content that I have created and changed was made for 2 languages: English and German. Reifen Direkt For this project, I had to make HTML static pages. I got previews for a redesign of pages in zeplin format and with them, I make the pages in HTML format. Here I use Node.js, SCSS, JavaScript, jQuery, Bootstrap 5. Also, some pages required the interaction and functionalities that were implemented with jQuery. I had meets with back-end team, where we were discussing the necessary changes to the temples that I had to make at few cases. Modern Vision Remodeling This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongside other plugins enhancing Elementor's capabilities, I crafted the website's visual and textual elements. Resurse Educationale Website for school projects, contests, courses and shop was made in WordPress. It have a custom PHP code integrated with 2 modules that which allows uploading files depending on the number of uploads or depending on the subscription. The files accepted by the administrator will be displayed on the site. The number of uploads and subscriptions can be purchased with payment by card. Payment can be made with the card through the EuPlatesc module.. Revel Nail - Avadores The online shop for powders, liquids and other nail accessories is made in Prestashop 1.6. On this website, the products are supplied by Revel Nail and sold by Avadores under the name Revel Nail Romania on the Romanian market. It has a shortcut module that has been modified by TPL to display a Facebook login button. Payment can be made with the card through the MobilPay module, which has also been modified by TPL and PHP to deactivate the payment method of this module for some products. Centrul de Excelenta Centrul de Excelenta proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the business. The purpose of this application is for users to be able to send pdf documents (magazines and books) to be uploaded to the site in the respective section, or they can choose to sign up for projects (such as contests) dedicated to teachers with different dates, including pdf files. The files that are sent to the site are saved in the hosting. The website's simplicity and user-friendly design allow visitors to easily explore and engage with our content. Round Selfie Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Royal Compass At this project I had to make a website for a company that promote sports in nature. This website was not completely finished in terms of the aspects of texts and images on the pages. Spalatorie Automata Baia Mare Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Special Events Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Speed - Satu Mare Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Striker Production Main activity of the Striker Production is the video editing at different video games and real life footage. In addition to creating my own video-photo content, I organize video editing contests with sponsors and I collaborate with clients on various projects. Simple portfolio website is made with Google Site. Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Super Brain Website made in WordPress for company presentation and contact. The website was made in few days, 3-5 days. At this project I worked with Elementor plugin for editing the theme pages and for creating new elements, also the theme on which was created this website, was changed more then 50%. All the images was rezise with Topaz Gigapixel and edited with Photopea. Tinib Website make in WordPress for services like thermal power plants, pumps, air conditioning, ventilation systems. At this website I had to create manually over 200 products with specific HTML description. Transport Osian Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Vreau Alpin I made several significant changes to this site as web design enhancements, content editor, and the addition of new functionalities. These updates included creating a redirect from the secondary site alpin57lux.com to the online store, implementing filters for approximately 100 products, modifying the CSS\/HTML of the theme to improve element display, and resolving various errors on the site, such as fixing the popup-close functionality. Additionally, I added an employerment form, implemented a zoom-in feature for the product slider, and addressed numerous other improvements and fixes. VSE Construct Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content that showcase my expertise in delivering impactful visuals for social media promotion. Explore the power of my unique visual creations and unlock the potential to captivate your audience. Wood Work Art Website make in WordPress for a company that provide authentic solid wood furniture, in modern or vintage style, hand carved or with CNC, of a high quality that guaranteed to offer you in any space an elegance, refinement and unique character. The site is made in 3 languages. Catalog Showcase of projects I have created or I was involved, featuring designs and functionality of media content and websites. Search Search items in the website. Summary Work Experience Experience a captivating journey through my professional work from 2019 to 2023 in this short resume of projects. Visual Media Projects Category: Visual Media Projects. Collection of visually captivating projects showcasing my expertise in graphic design, photo editing, and video production. Web Development Projects Category: Web Development Projects. Showcase of websites and online shops I have created, featuring engaging designs and seamless functionality. Personal Workstation Welcome to my personal workstation page! This is the hub of my productivity, where I tackle work projects and pursue personal endeavors. Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": ""
    },
    {
        "page": "summary-experience.html",
        "meta-title": "Summary Work Experience",
        "meta-description": "Experience a captivating journey through my professional work from 2019 to 2023 in this short resume of projects.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Summary Work Experience 2019 - 2022 1. Web Development Projects PHP\/SQL\/HTML\/JS\/CSS FORM - WORDPRESS Single Form Page made with PHP, HTML, CSS, JavaScript and SQL. The PHP code works in this way: You get the data from form and at the submit button it will create a database if it doesn't exist, will verify the data, all check boxes must be checked, the input fields must be non empty, one radio box must be checked, the code from invoice with the phone number must be unique and used only once in the database (in this example), the data submit must be within the set data range (begin date - end date) and the file upload must be an image in JPG, PNG or GIF format with maximum size of 40 Mb. If the conditions are met, the image file will be compressed and saved in a folder with the name of SQL table name in 'wp-content', the data will be saved in a SQL table from data base with a URL for image, and in the final, the page will reload and instead of the form content will show a specific banner for success status. 1 \/ 4 2 \/ 4 3 \/ 4 4 \/ 4 If the conditions are not met, a specific error message will be displayed below each field, and if the invoice code was previously used in the database, a pop-up message with a specific error message will be displayed or a banner will be displayed. If the campaign has started, the submit button from the form will not appear or a banner will appear instead of the form, if the campaign is over, a banner will appear instead of the form. A button to download CSV data from data base will show if you are an admin or editor of WordPress, or if you have the credentials from code inserted in URL. The form is implemented with PHP Everywhere widget and Elementor page builder. UPLOAD PAID ARTICLES - WORDPRESS This project have a custom PHP code integrated with 2 modules that which allows you uploading files depending on the number of uploads or depending on the subscription. The number of uploads and subscriptions can be purchased with payment by card. The files accepted by the administrator will be displayed on the site and stored in a SQL database. Modules used: Elementor, PHP Everywhere, WooCommerce, WooCommerce Points and Rewards, WooCommerce Memberships AUTOCOMPLET FORM - PRESTASHOP This is the Contact Form 7 module, but modified (with PHP, TPL and JavaScript), so that it takes over the user's data: name, email, phone and automatically fills them in the form. On the product page is displayed a button to request an offer, and it displays the form form but autocompletes the message field with a text containing the name of the desired product \"I want to receive an offer for this product: product-name\". Modules used: Elementor, Contact Form 7, Boom Custom CSS and Javascript WEB DESIGN - STATIC WEB PAGES For this project, I hosted a local server with Node.js and I recreated the design from image templates provided, in static web pages using HTML, CSS, SASS, Bootstrap, JavaScript, and jQuery. SEO OPTIMIZATION - PRESTASHOP & WORDPRESS For some websites, I had to do SEO Optimization, with tools like Google Chrome Lighthouse for fixing errors, adding meta titles, meta descriptions, and keywords for pages, fixing hreflang links, fixing alt images, fixing multiple h1 tags, performance increase where is possible, CSS and JS code inline, adding robots.txt, generate pages map, and indexing on Google Search Console. Projects: www.agromir.ro , www.agramix.ro , www.revelnail.ro . EXPORT PRODUCTS FEED - PRESTASHOP With this PHP script you can export all products with name, url, images, price, stock, description, summary, ean13. It is not optimized for products with combinations. Can be use as a feed with a cron job. IMPORT PRODUCTS FROM FEED - PRESTASHOP Add products to the Prestashop 1.7 website from a CSV feed, create products, set stock, create categories, brand, disable if the scripts can't find the products in CSV anymore. This import is made with 2 PHP scripts that are used as cron jobs in cPanel, but can be use with a cron module to. These 2 scripts make stock synchronization possible of 2 stores, in other words it takes the data from feed, feed provided from the globiz.ro store and is used at the lavmag.ro store. 2. Video Editing Projects 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 0:00 \/ 1x 3. Photo Editing Projects 4. 3D EDITING TIRE ANIMATION - BLENDER Simple animation made in Blender with free 3d tire objects for a video advertisement. 0:00 \/ 1x Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/summary-experience\/promotions-contact-form-web-1.webp"
    },
    {
        "page": "visual-media-projects.html",
        "meta-title": "Visual Media Projects",
        "meta-description": "Category: Visual Media Projects. Collection of visually captivating projects showcasing my expertise in graphic design, photo editing, and video production.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Visual Media Projects Visual Media Projects Spalatorie Automata Baia Mare 2022 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects VSE Construct 2022 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Netex Romania 2023 At this site, I had to do maintenance, fixing back-end bugs, PHP files from theme files, troubleshooting, code changes, plugin upd Visual Media Projects Gamada Metal 2021 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Transport Osian 2021 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Agramix 2021 The online shop for tools, machine parts, agricultural and industrial equipment is made in Prestashop 1.7. The theme on which the Visual Media Projects Casa Darius 2022 The online shop for furniture is made in Prestashop 1.7 with integrated payment method, via MobilPay. The products cannot be added Visual Media Projects Dabo - SM & BM 2020 Here is my media content for the promotion of Dabo Satu Mare & Dabo Baia Mare during the pandemic, which took place in 2020. Exper Visual Media Projects DS Auto Center 2020 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Agromir 2022 The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Visual Media Projects HART - Keep your hat on 2020 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Bus-Vip 2022 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Speed - Satu Mare 2020 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects My Creative Design 2019 Experience the artistry behind my meticulously crafted media content for this company. Discover a captivating collection content t Visual Media Projects Mobila Simex Plus 2020 Mobila Simex Plus proudly presents a minimalistic online shop created with Prestashop 1.7, offering a clean and captivating showca Visual Media Projects Revel Nail - Avadores 2022 The online shop for powders, liquids and other nail accessories is made in Prestashop 1.6. On this website, the products are suppl Visual Media Projects Pia Soft Product 2022 This is a company's presentation site, and is made in Wordpress with modules such as Elementor and Contact Form 7. Also the redesi Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/spalatorieautomatabaiamare\/logo\/logo.png"
    },
    {
        "page": "web-development-projects.html",
        "meta-title": "Web Development Projects",
        "meta-description": "Category: Web Development Projects. Showcase of websites and online shops I have created, featuring engaging designs and seamless functionality.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact Web Development Projects Web Development Projects Modern Vision Remodeling 2024 This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Philadelphia Rug Cleaning 2024 This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Logistic Brain 2024 This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Merkaz Ha-Ir - City Center 2024 This project involves the design and content creation for a website. Utilizing Figma for design the content with Elementor, alongs Web Development Projects Petri 2023 At this project I worked in a team to create a custom theme in Wordpress. My part at this project was to translate content from th Web Development Projects Pur Style 2023 At this project I had to make some page reworks, fixing errors adding new features like booking and contact form. The new pages I Web Development Projects Royal Compass 2023 At this project I had to make a website for a company that promote sports in nature. This website was not completely finished in t Web Development Projects Super Brain 2022 Website made in WordPress for company presentation and contact. The website was made in few days, 3-5 days. At this project I work Web Development Projects Ilnic Electric 2022 Ilnic Electric proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the b Web Development Projects Mewi 2023 At this Wordpress site, I had to do maintenance, troubleshooting, code changes, plugin updates, and creating HTML & CSS content fo Web Development Projects Netex Romania 2023 At this site, I had to do maintenance, fixing back-end bugs, PHP files from theme files, troubleshooting, code changes, plugin upd Web Development Projects Reifen Direkt 2022 For this project, I had to make HTML static pages. I got previews for a redesign of pages in zeplin format and with them, I make t Web Development Projects AXA Company 2021 AXA Company proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for the busi Web Development Projects Medical Ortovit - Products 2021 When I started working on it, the website was already 60% complete. Website make in WordPress for blog and the sale of medical pro Web Development Projects Bonea Med 2022 This project involved creating a clinic website with appointment booking functionality. I used the Booked module in a WordPress we Web Development Projects Concordia CAR 2021 Concordia proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The websi Web Development Projects Acvatic Bebe Club 2021 A website has been created using WordPress to provide subscriptions for teaching babies and children how to swim. The site feature Web Development Projects Tinib 2021 Website make in WordPress for services like thermal power plants, pumps, air conditioning, ventilation systems. At this website I Web Development Projects Covoare Alex 2021 The online shop for different types and models of carpets, is made in Prestashop 1.7 with integrated payment method, via MobilPay. Web Development Projects Brisa Scents 2020 I have continued this project from a stage of 20% - 30% done, a WordPress website for perfume and spray sales. User-friendly inter Web Development Projects FreyMob Design 2021 The online shop for furniture is made in Prestashop 1.6. The site has 3 languages, and 2 currencies. The products on this applicat Web Development Projects Agromir Second-Hand 2022 The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Web Development Projects Resurse Educationale 2020 Website for school projects, contests, courses and shop was made in WordPress. It have a custom PHP code integrated with 2 modules Web Development Projects Agramix 2021 The online shop for tools, machine parts, agricultural and industrial equipment is made in Prestashop 1.7. The theme on which the Web Development Projects Casa Darius 2022 The online shop for furniture is made in Prestashop 1.7 with integrated payment method, via MobilPay. The products cannot be added Web Development Projects Lavmag 2020 The online shop for a wide range of products is built using Prestashop 1.7. All products are regularly updated and uploaded throug Web Development Projects Ambalaje Lavplast 2020 The online shop, built on Prestashop 1.7, offers a wide range of products. Customers can conveniently make payments using their ca Web Development Projects Masini in Rate Baia Mare 2020 Masini in Rate Baia Mare proudly presents a minimalistic online shop created with WordPress, offering a clean and captivating show Web Development Projects Ceramic & Stone Evolutione 2020 Evolutione proudly presents a minimalistic online shop created with Prestashop 1.6, offering a clean and captivating showcase for Web Development Projects Amorino 2020 The website, specializing in selling dresses for girls, is built using Prestashop 1.7. Customers have the option to make payments Web Development Projects Centrul de Resurse Educationale 2022 Centrul de Resurse Educationale proudly presents a minimalistic website created with WordPress, offering a clean and captivating s Web Development Projects Cafea Gano 2020 WordPress website created for an online shop specializing in natural supplements and coffee. The shop was made using the Woocommer Web Development Projects Promotii Mars 2022 Website make in WordPress for contests and promotions. Most of the contests are created in a custom PHP form. The design of the fo Web Development Projects Agromir 2022 The online shop for tools, industrial equipment tires, tractor tires is made in Prestashop 1.7. The products cannot be added to th Web Development Projects Casa Darius 2020 Casa Darius proudly presents a website created with WordPress, offering a clean and captivating showcase for the business. The web Web Development Projects BRB Home 2019 This was one of the first websites I created using WordPress. The purpose of the project was to develop a presentation website aim Web Development Projects Copiatoare Alba Iulia 2019 Copiatoare Alba Iulia proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase fo Web Development Projects Mobila Simex Plus 2020 Mobila Simex Plus proudly presents a minimalistic online shop created with Prestashop 1.7, offering a clean and captivating showca Web Development Projects Revel Nail - Avadores 2022 The online shop for powders, liquids and other nail accessories is made in Prestashop 1.6. On this website, the products are suppl Web Development Projects Centrul de Excelenta 2022 Centrul de Excelenta proudly presents a minimalistic website created with WordPress, offering a clean and captivating showcase for Web Development Projects Wood Work Art 2019 Website make in WordPress for a company that provide authentic solid wood furniture, in modern or vintage style, hand carved or wi Web Development Projects A&A Toys & Furniture 2019 This is one of the first websites I have created in my career. When I started working on it, the website was already 25% complete. Web Development Projects Mara Safety 2019 This is one of the first websites I have created in my career. When I started working on it, the website was already 30% complete. Web Development Projects Pia Soft Product 2022 This is a company's presentation site, and is made in Wordpress with modules such as Elementor and Contact Form 7. Also the redesi Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/projects\/remodelingmv\/web\/home\/home.webp"
    },
    {
        "page": "workstation.html",
        "meta-title": "Personal Workstation",
        "meta-description": "Welcome to my personal workstation page! This is the hub of my productivity, where I tackle work projects and pursue personal endeavors.",
        "content": "Denis Marginas Home Experience Experience as an employee Educational experience path Projects Web Development Visual Media Miscellaneous Contact WORKSTATION PC #1 Setup Welcome to my personal workstation page! This is the hub of my productivity, where I tackle work projects and pursue personal endeavors. With regular updates and enhancements, I strive to maintain an efficient and inspiring work environment. The most recent update to my setup was in January 2023, and I'm excited to showcase the improvements I've made. Get ready to explore my workstation and discover the tools and setup that fuel my productivity! PC #1 Configuration GPU GIGABYTE GeForce RTX 3070 OC 8GB GDDR6 256-bit CPU AMD Ryzen 5 7600X 38MB 4.7\/5.3GHz Boost Cooler ARCTIC Freezer 34 eSports DUO Grey Motherboard ASUS TUF GAMING B650-PLUS AM5 RAM Kingston FURY Beast 32GB DDR5 5200MHz CL40 Dual Channel Computer Case AQIRYS Antares ARGB SSD GIGABYTE 480GB SATA-III 2.5 inch SSD Kingston NV2 1TB PCI Express 4.0 x4 M.2 2280 PSU GIGABYTE P850GM 80+ Gold 850W GPU GIGABYTE GeForce RTX 3070 OC 8GB GDDR6 256-bit CPU AMD Ryzen 5 7600X 38MB 4.7\/5.3GHz Boost Cooler ARCTIC Freezer 34 eSports DUO Grey Motherboard ASUS TUF GAMING B650-PLUS AM5 RAM Kingston FURY Beast 32GB DDR5 5200MHz CL40 Dual Channel Computer Case AQIRYS Antares ARGB SSD GIGABYTE 480GB SATA-III 2.5 inch SSD Kingston NV2 1TB PCI Express 4.0 x4 M.2 2280 PSU GIGABYTE P850GM 80+ Gold 850W 1 \/ 3 2 \/ 3 3 \/ 3 PC #1 Accessories Headset wireless HyperX Cloud Stinger Core 7.1 Mouse LOGITECH G203 LIGHTSYNC RGB, 8.000 dpi Mechanical Keyboard LOGITECH G512 GX Red Linear Mouse Pad GENESIS Carbon 700 Maxi Cordura Speakers Trust Arys Compact RGB 2.0 Set Monitor IPS SAMSUNG Odyssey G5, 27 Inch, WQHD, 165Hz Monitor LED ASUS PB277Q 27 Inch, WQHD, 75Hz ORICO USB C HUB 3.0 Desktop 2x HDD Extern Seagate Expansion Portable 1TB 2.5 Inch USB 3.0 1x HDD Extern Seagate Expansion Portable 1TB 2.5 Inch USB 3.0 Headset wireless HyperX Cloud Stinger Core 7.1 Mouse LOGITECH G203 LIGHTSYNC RGB, 8.000 dpi Mechanical Keyboard LOGITECH G512 GX Red Linear Mouse Pad GENESIS Carbon 700 Maxi Cordura Speakers Trust Arys Compact RGB 2.0 Set Monitor IPS SAMSUNG Odyssey G5, 27 Inch, WQHD, 165Hz Monitor LED ASUS PB277Q 27 Inch, WQHD, 75Hz ORICO USB C HUB 3.0 Desktop 2x HDD Extern Seagate Expansion Portable 1TB 2.5 Inch USB 3.0 1x HDD Extern Seagate Expansion Portable 1TB 2.5 Inch USB 3.0 Desktop Setup | IRL Setup #1 Workstation Date: Apr 25, 2023 Video Timeline: 00:00 - 00:03 - Intro 00:03 - 00:16 - Setup Info 00:16 - 01:30 - Showcase Peripherals and Accessories 01:30 - 01:52 - Showcase PC Components 02:29 - 02:42 - Otro 0:00 \/ 1x Contact CV English CV Romanian Contact Form Catalog Web Development Projects Visual Media Projects Miscellaneous Projects Socials Begining of the webiste: 04.06.2023 Last update of webiste: 17.05.2024 ©All copyrights reserved by Denis Marginas",
        "default-img": "..\/..\/content\/img\/workstation\/pc-00.webp"
    }
]